[{"directions": ["1. Place the stock, lentils, celery, carrot, thyme, and salt in a medium saucepan and bring to a boil. Reduce heat to low and simmer until the lentils are tender, about 30 minutes, depending on the lentils. (If they begin to dry out, add water as needed.) Remove and discard the thyme. Drain and transfer the mixture to a bowl; let cool.", "2. Fold in the tomato, apple, lemon juice, and olive oil. Season with the pepper.", "3. To assemble a wrap, place 1 lavash sheet on a clean work surface. Spread some of the lentil mixture on the end nearest you, leaving a 1-inch border. Top with several slices of turkey, then some of the lettuce. Roll up the lavash, slice crosswise, and serve. If using tortillas, spread the lentils in the center, top with the turkey and lettuce, and fold up the bottom, left side, and right side before rolling away from you."], "fat": 7.0, "date": "2006-09-01T04:00:00.000Z", "categories": ["Sandwich", "Bean", "Fruit", "Tomato", "turkey", "Vegetable", "Kid-Friendly", "Apple", "Lentil", "Lettuce", "Cookie"], "calories": 426.0, "desc": null, "protein": 30.0, "rating": 2.5, "title": "Lentil, Apple, and Turkey Wrap ", "ingredients": ["4 cups low-sodium vegetable or chicken stock", "1 cup dried brown lentils", "1/2 cup dried French green lentils", "2 stalks celery, chopped", "1 large carrot, peeled and chopped", "1 sprig fresh thyme", "1 teaspoon kosher salt", "1 medium tomato, cored, seeded, and diced", "1 small Fuji apple, cored and diced", "1 tablespoon freshly squeezed lemon juice", "2 teaspoons extra-virgin olive oil", "Freshly ground black pepper to taste", "3 sheets whole-wheat lavash, cut in half crosswise, or 6 (12-inch) flour tortillas", "3/4 pound turkey breast, thinly sliced", "1/2 head Bibb lettuce"], "sodium": 559.0}, {"directions": ["Combine first 9 ingredients in heavy medium saucepan. Add 3 shallots. Bring to simmer. Remove from heat, cover and let stand 30 minutes. Chill overnight.", "Preheat oven to 325°F. Line 7-cup pâté or bread pan with plastic wrap. Melt butter in heavy small skillet over low heat. Add remaining 5 shallots. Cover and cook until very soft, stirring occasionally, about 15 minutes. Transfer to processor. Add pork, eggs, flour and Port and puree. Strain cream mixture, pressing on solids to extract as much liquid as possible. With processor running, add cream through feed tube and process just until combined with pork. Transfer to large bowl. Mix in currants.", "Spoon mixture into prepared pan. Cover with foil. Place pan in large pan. Add boiling water to larger pan to within 1/2 inch of top of terrine. Bake until terrine begins to shrink from sides of pan and knife inserted into center comes out clean, about 1 1/2 hours. Uncover and cool on rack. Chill until cold. (Can be made 3 days ahead. Cover and chill.)", "Line platter with lettuce. Arrange terrine atop. Sprinkle with pepper and parsley. Garnish with bay leaves. Spoon confit around sides. Serve with bread.", "Heat oil in heavy large skillet over medium-high heat. Add onions and sauté until crisp-tender, about 8 minutes. Add all remaining ingredients and stir until reduced to thick glaze, about 4 minutes. Season with salt and pepper. (Can be prepared 2 days ahead. Cover and chill.) Serve warm or at room temperature."], "fat": 23.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Food Processor", "Onion", "Pork", "Bake", "Bastille Day", "New Year's Eve", "Dried Fruit", "Port", "Winter", "Chill", "Bon Appétit"], "calories": 403.0, "desc": "This uses the same ingredients found in boudin blanc, the classic French white sausage. Start two days before serving.", "protein": 18.0, "rating": 4.375, "title": "Boudin Blanc Terrine with Red Onion Confit ", "ingredients": ["1 1/2 cups whipping cream", "2 medium onions, chopped", "5 teaspoons salt", "3 bay leaves", "3 whole cloves", "1 large garlic clove, crushed", "1 teaspoon pepper", "1/8 teaspoon ground nutmeg", "Pinch of dried thyme, crumbled", "8 large shallots, minced", "1 tablespoon butter", "1 pound trimmed boneless center pork loin, sinew removed cut into 1-inch chunks, well chilled", "3 eggs", "6 tablespoon all purpose flour", "1/4 cup tawny Port", "3 tablespoons dried currants, minced", "Lettuce leaves", "Cracked peppercorns", "Minced fresh parsley", "Bay leaves", "French bread baguette slices", "3 tablespoons olive oil", "2 large red onions, halved, sliced", "3 tablespoons dried currants", "3 tablespoons red wine vinegar", "1 tablespoons canned chicken broth", "2 teaspoons chopped fresh thyme or 3/4 teaspoon dried, crumbled", "1/2 teaspoon sugar"], "sodium": 1439.0}, {"directions": ["In a large heavy saucepan cook diced fennel and onion in butter over moderate heat, stirring, until softened, about 10 minutes. Peel and cube potatoes. Add potatoes and broth to fennel mixture and simmer, covered, until potatoes are very tender, about 20 minutes. In a blender or food processor purée mixture in batches until smooth and return to saucepan. Stir in milk and salt and pepper to taste and simmer soup, stirring occasionally, 10 minutes, or until heated through.", "Garnish soup with reserved fennel leaves."], "fat": 7.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Soup/Stew", "Dairy", "Potato", "Vegetable", "Fennel", "Gourmet", "New York"], "calories": 165.0, "desc": null, "protein": 6.0, "rating": 3.75, "title": "Potato and Fennel Soup Hodge ", "ingredients": ["1 fennel bulb (sometimes called anise), stalks discarded, bulb cut into 1/2-inch dice, and feathery leaves reserved for garnish", "1 onion, diced", "2 tablespoons unsalted butter", "2 medium russet (baking) potatoes", "2 cups chicken broth", "1 1/2 cups milk"], "sodium": 165.0}, {"directions": ["Heat oil in heavy large skillet over medium-high heat. Add onion; sauté until translucent and beginning to brown, about 4 minutes. Add wine and anchovy paste. Boil until reduced to 3/4 cup, about 3 minutes. Add tomatoes with juice; bring to boil.", "Sprinkle fish with salt and pepper. Add fish to skillet atop tomato mixture. Reduce heat to low, cover, and simmer until fish is cooked through, about 9 minutes. Using slotted metal spatula, transfer fish to plate and tent with foil to keep warm. Mix olives, 2 teaspoons oregano, and orange peel into sauce in skillet. Increase heat to high and boil until sauce is reduced and thickened, about 6 minutes. Season to taste with salt and pepper. Place 1 fish fillet on each of 4 plates. Pour sauce over and around fish, sprinkle with remaining 1 teaspoon oregano, and serve with warm toasted bread."], "fat": null, "date": "2009-03-27T04:00:00.000Z", "categories": ["Fish", "Olive", "Tomato", "Sauté", "Low Fat", "Low Cal", "High Fiber", "Dinner", "Healthy", "Simmer", "Bon Appétit", "Pescatarian", "Dairy Free", "Peanut Free", "Tree Nut Free", "Soy Free", "Kosher"], "calories": null, "desc": "The Sicilian-style tomato sauce has tons of Mediterranean flavor, thanks to the orange peel, olives, and oregano.", "protein": null, "rating": 5.0, "title": "Mahi-Mahi in Tomato Olive Sauce ", "ingredients": ["2 tablespoons extra-virgin olive oil", "1 cup chopped onion", "1 cup dry white wine", "1 teaspoon anchovy paste", "2 14 1/2-ounce cans diced tomatoes with garlic, basil, and oregano in juice", "4 6-ounce mahi-mahi fillets", "1/2 cup large green olives, quartered, pitted", "3 teaspoons chopped fresh oregano, divided", "1 teaspoon (packed) finely grated orange peel", "Country-style white bread cut into 1/2-inch-thick slices, toasted"], "sodium": null}, {"directions": ["Preheat oven to 350°F. Lightly grease 8x8x2-inch glass baking dish. Blend spinach, noodles, sour cream, pesto sauce and nutmeg in large bowl. Spoon mixture into prepared dish. Sprinkle cheese over. Bake until set, about 45 minutes. Let stand 10 minutes."], "fat": 32.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Cheese", "Dairy", "Pasta", "Vegetable", "Side", "Bake", "Vegetarian", "Quick & Easy", "Fall", "Bon Appétit", "California"], "calories": 547.0, "desc": null, "protein": 20.0, "rating": 3.125, "title": "Spinach Noodle Casserole ", "ingredients": ["1 12-ounce package frozen spinach soufflé, thawed", "1/2 pound extra-wide egg noodles, freshly cooked", "1 cup sour cream", "2 tablespoons purchased pesto sauce", "1/4 teaspoon ground nutmeg", "1 cup grated sharp cheddar cheese"], "sodium": 452.0}, {"directions": ["Mix basil, mayonnaise and butter in processor until basil is finely chopped and mixture is well blended. Season to taste with salt and pepper. (Can be made 1 day ahead. Cover and refrigerate.)", "Cook bacon in heavy large skillet over medium-high heat until crisp, about 8 minutes. Transfer to paper towels; drain.", "Spread half of mayonnaise mixture over 1 side of 6 bread slices. Top each with 2 tomato slices. Sprinkle tomatoes with salt and pepper. Top tomato slices with avocado, then with bacon strips, onion and lettuce. Spread remaining mayonnaise mixture over remaining 6 bread slices. Place bread slices atop lettuce. Cut sandwiches in half and serve."], "fat": 79.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Sandwich", "Food Processor", "Tomato", "Kid-Friendly", "Quick & Easy", "Basil", "Bacon", "Summer", "Lettuce", "Bon Appétit"], "calories": 948.0, "desc": "This recipe can be prepared in 45 minutes or less.", "protein": 19.0, "rating": 4.375, "title": "The Best Blts ", "ingredients": ["2 1/2 cups (lightly packed) fresh basil leaves", "1 cup mayonnaise", "1/4 cup butter, room temperature", "12 thick-sliced bacon strips (about 1 pound)", "12 1/2-inch-thick slices fresh country-style white bread", "3 large tomatoes, cut into 1/4-inch-thick rounds", "2 ripe avocados, pitted, peeled, sliced", "1 red onion, thinly sliced", "6 lettuce leaves"], "sodium": 1042.0}, {"directions": ["Cook potatoes and carrots in large pot of boiling salted water until almost tender, about 7 minutes. Add asparagus and peas; cook until vegetables are just tender, about 3 minutes longer. Drain. Rinse with cold water; drain. Transfer to large bowl. (Can be prepared 1 day ahead. Cover; chill.)", "Add ham to vegetables. Add Shallot Vinaigrette to salad and toss to coat. Season to taste with salt and pepper.", "Line bowl with spinach. Top with salad and serve."], "fat": null, "date": "2004-08-20T04:00:00.000Z", "categories": ["Salad", "Potato", "Side", "Easter", "Low Fat", "Quick & Easy", "Ham", "Asparagus", "Spinach", "Carrot", "Spring", "Healthy", "Sugar Snap Pea", "Boil", "Bon Appétit", "Dairy Free", "Wheat/Gluten-Free", "Peanut Free", "Tree Nut Free", "Soy Free", "No Sugar Added"], "calories": null, "desc": "Serve this newfangled main-course salad with a crisp flatbread, such as lavash, and white wine or rosé spritzers.", "protein": null, "rating": 4.375, "title": "Ham and Spring Vegetable Salad with Shallot Vinaigrette ", "ingredients": ["1 1/2 pounds small red-skinned potatoes, each cut into 8 wedges", "1 1/2 pounds baby carrots, peeled, cut lengthwise in half", "1 1/2 pounds asparagus, trimmed, cut into 2-inch pieces", "6 ounces sugar snap peas, trimmed", "18 ounces low-fat (97% fat-free) smoked ham, cut into 1/4-inch-thick slices, then into 2-inch-long by 1/2-inch-wide pieces", "Shallot Vinaigrette", "1 6-ounce package fresh baby spinach"], "sodium": null}, {"directions": ["Stir together sugar and chili powder. Whisk egg whites with water until dissolved. Working with 1 kumquat at a time, dip 1 side in whites, letting excess drip off, then dip in sugar mixture. Transfer to a rack to dry, coated side up."], "fat": null, "date": "2004-08-20T04:00:00.000Z", "categories": ["Egg", "Fruit", "No-Cook", "Cocktail Party", "Vegetarian", "Winter", "Kumquat", "Gourmet"], "calories": null, "desc": "Pop one of these in your mouth for a burst of bittersweet flavor.", "protein": null, "rating": 3.75, "title": "Spicy-Sweet Kumquats ", "ingredients": ["6 tablespoons granulated sugar", "1 1/2 tablespoons chili powder", "4 teaspoons powdered egg whites (see Cooks' notes)", "1/4 cup warm water", "60 kumquats (preferably thin-skinned)"], "sodium": null}, {"directions": ["Stir together soy sauce, sugar, sesame oil, white and pale green scallions, garlic, ginger, and 2 tablespoons sesame seeds in a bowl until sugar is dissolved. Add steak and toss to coat, then marinate 15 minutes.", "Heat vegetable oil in a 12-inch heavy skillet over high heat until just smoking, then add steak in 1 layer and sauté, turning over occasionally, until browned and just cooked through, about 5 minutes total. Transfer to a platter and sprinkle with scallion greens and remaining 1 tablespoon sesame seeds, then serve with accompaniments.", "*Available at Asian markets and many supermarkets."], "fat": 10.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Beef", "Ginger", "Sauté", "Stir-Fry", "Quick & Easy", "Spring", "Soy Sauce", "Gourmet"], "calories": 170.0, "desc": "Bulgogi", "protein": 7.0, "rating": 4.375, "title": "Korean Marinated Beef ", "ingredients": ["1/4 cup soy sauce", "1 tablespoon sugar", "2 teaspoons Asian sesame oil", "1 bunch scallions (white and pale green parts separated from greens), minced (1/2 cup)", "1 tablespoon minced garlic", "1 tablespoon minced peeled fresh ginger", "3 tablespoons sesame seeds, toasted", "1 lb flank steak, cut across the grain into very thin slices (no more than 1/8 inch thick)", "1 tablespoon vegetable oil", "Accompaniments: butter lettuce or other soft-leaf lettuce; thinly sliced garlic; packaged kimchi*; steamed white rice"], "sodium": 1272.0}, {"directions": ["Chop enough parsley leaves to measure 1 tablespoon; reserve. Chop remaining leaves and stems and simmer with broth and garlic in a small saucepan, covered, 5 minutes.", "Meanwhile, sprinkle gelatin over water in a medium bowl and let soften 1 minute. Strain broth through a fine-mesh sieve into bowl with gelatin and stir to dissolve. Season with salt and pepper. Set bowl in an ice bath and cool to room temperature, stirring.", "Toss ham with reserved parsley and divide among jars. Pour gelatin on top and chill until set, at least 1 hour.", "Whisk together mayonnaise, mustard, vinegar, 1/4 teaspoon salt, and 1/4 teaspoon pepper in a large bowl. Stir in celery, cornichons, and potatoes.", "Pulse peas with marjoram, oil, 1/2 teaspoon pepper, and 1/4 teaspoon salt in a food processor to a coarse mash.", "Layer peas, then potato salad, over ham."], "fat": 41.0, "date": "2008-10-23T22:24:26.000Z", "categories": ["Salad", "Mustard", "Potato", "Picnic", "Lunch", "Mayonnaise", "Ham", "Pea", "Summer", "Gourmet", "Sugar Conscious", "Dairy Free", "Wheat/Gluten-Free", "Peanut Free", "Tree Nut Free", "Soy Free"], "calories": 602.0, "desc": "Transform your picnic into un pique-nique to remember with this elegant arrangement of tangy potato salad, peas gently mashed with marjoram, and salty ham softly set in parsleyed gelatin.", "protein": 23.0, "rating": 3.75, "title": "Ham Persillade with Mustard Potato Salad and Mashed Peas ", "ingredients": ["6 long parsley sprigs, divided", "1 3/4 cups reduced-sodium chicken broth", "1 large garlic clove, minced", "2 teaspoon unflavored gelatin (from 1 envelope)", "3 tablespoons water", "1 (3/4-pound) piece baked ham, cut into 1/2-inch cubes (2 cups)", "1/2 cup mayonnaise", "2 tablespoons Dijon mustard", "2 tablespoons white-wine vinegar", "2 celery ribs, finely chopped (1 cup)", "1/4 cup chopped cornichons or sour gherkins", "1 pound boiled potatoes, peeled and cut into 1/2-inch cubes (2 1/2 cups)", "1 (10-ounce) box frozen baby peas, thawed", "2 teaspoons finely chopped marjoram", "3 tablespoons extra-virgin olive oil", "Equipment: 4 (16-ounce) wide jars or containers with lids", "Garnish: celery leaves"], "sodium": 1696.0}, {"directions": ["Heat oil in heavy large skillet over medium-high heat. Add shallots and minced rosemary and sauté until tender, about 3 minutes. Add yams and broth to skillet and bring to boil. Cover skillet, reduce heat to medium-low and simmer until yams are almost tender, about 10 minutes. Add cream and sprinkle lightly with nutmeg. Simmer uncovered until yams are very tender and liquid thickens and coats yams, about 4 minutes. Season with salt and pepper. (Can be made 1 day ahead. Transfer to microwave-safe dish. Chill until cold, then cover and keep chilled. Rewarm, covered, in microwave on medium-low heat.)"], "fat": 5.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Milk/Cream", "Dairy", "Side", "Thanksgiving", "Rosemary", "Sweet Potato/Yam", "Fall", "Nutmeg", "Simmer", "Bon Appétit"], "calories": 256.0, "desc": "Simmering the yams fills them with flavor and yields a lovely coating.", "protein": 4.0, "rating": 3.75, "title": "Yams Braised with Cream, Rosemary and Nutmeg ", "ingredients": ["4 teaspoons olive oil", "1/2 cup finely chopped shallots", "2 1/2 teaspoons minced fresh rosemary", "3 pounds yams (red-skinned sweet potatoes), peeled, cut into 1/2-inch-thick rounds, rounds cut in half", "1 1/4 cups canned low-salt chicken broth", "1/2 cup whipping cream", "Ground nutmeg"], "sodium": 30.0}, {"directions": ["Preheat oven to 300°F.", "Wrap blacan tightly in a piece of foil and roast in middle of oven 10 minutes. Unwrap and cool. Discard tough outer leaves of lemongrass and trim root ends. Thinly slice lower 6 inches of stalks. Fold upper stalks into thirds and tie into a bundle with kitchen string. In 2 batches, purée blacan, sliced lemongrass, and remaining spice paste ingredients in a mini food processor until almost smooth.", "Soak bean-curd puffs in hot water in a bowl, weighted with another bowl of water to keep puffs immersed, 20 minutes. Squeeze as much water as possible from puffs and halve diagonally. While puffs soak, simmer chicken in stock in a saucepan, turning occasionally, until just cooked through, 12 to 15 minutes, and cool chicken in a bowl. Pour stock through a fine sieve into another bowl. Discard chicken skin and bones and shred or slice chicken. Blanch bean sprouts in a pot of boiling water 15 seconds and drain well.", "Heat oil in a 6- to 7-quart heavy pot over moderate heat until hot but not smoking and stir in spice paste. (Oil should be hot enough for spice paste to sizzle when added.) Cook, stirring constantly, until spice paste begins to stick to bottom of pot, 8 to 10 minutes. (Oil will separate out, and mixture will appear curdled. Paste will reduce and turn a shade darker; do not let brown.) Add coconut milk, sugar, stock, and lemongrass bundle and bring to a simmer, stirring. Stir in puffs and gently simmer 20 minutes. Stir in shrimp and simmer until just cooked through, 1 to 2 minutes. Stir in chicken and salt to taste.", "While laksa simmers, bring a large pot of water to a boil for noodles. If using fresh noodles, cook 1 minute and drain well, rinsing briefly under water if sticking occurs. If using dried noodles, cook according to package directions. Divide noodles, bean sprouts, shrimp, chicken, and puffs among 4 deep bowls and ladle laksa broth over."], "fat": null, "date": "2004-08-20T04:00:00.000Z", "categories": ["Soup/Stew", "Chicken", "Garlic", "Ginger", "Pepper", "Breakfast", "Coconut", "Shrimp", "Spring", "Lemongrass", "Gourmet", "Dairy Free", "Peanut Free"], "calories": null, "desc": "(Tony Tan's Laksa Lemak)", "protein": null, "rating": 4.375, "title": "Spicy Noodle Soup ", "ingredients": ["11/2 teaspoons blacan (shrimp paste)", "2 thick or 3 thin stalks fresh lemongrass", "11/2 tablespoons chopped peeled fresh or frozen galangal", "1 tablespoon chopped peeled fresh ginger", "1 tablespoon chopped peeled fresh or frozen turmeric or 1 teaspoon turmeric powder", "1 medium onion, chopped", "6 fresh hot red chiles (such as Thai or serrano), seeded if desired and chopped", "2 garlic cloves, chopped", "5 candlenuts (do not eat raw) or macadamia nuts, chopped", "2 tablespoons water", "6 fried bean-curd puffs", "2 chicken breast halves with skin and bones", "31/2 cups chicken stock (preferably homemade)", "6 oz fresh bean sprouts (21/2 cups), threadlike tails discarded", "1/2 cup olive or vegetable oil", "14-oz can well-shaken unsweetened coconut milk", "1 tablespoon sugar", "1/2 lb medium shrimp, shelled and deveined", "1 lb fresh round (not flat) rice noodles or wheat noodles or 1/2 lb dried egg noodles", "Garnish: fresh cilantro sprigs"], "sodium": null}, {"directions": ["Preheat oven to 350°F. Coat cake pans with nonstick spray. Line bottom of pans with parchment; coat paper. Whisk flour, baking soda, and salt in a medium bowl. Using an electric mixer, beat sugar, butter, and brown sugar in a large bowl until light and fluffy, about 3 minutes. Add eggs one at a time, beating to blend between additions and occasionally scraping down sides and bottom of bowl. Beat in vanilla.", "Add dry ingredients; beat on low speed just to blend. Add bananas and sour cream; beat just to blend. Fold in mini chips. Divide batter evenly among pans; smooth tops.", "Bake cakes until a tester inserted into the center comes out clean, about 35 minutes. Transfer to wire racks; let cool in pans for 10 minutes. Invert cakes onto racks; peel off parchment and let cool completely.", "Using an electric mixer, beat first 4 ingredients in a medium bowl until a light and fluffy frosting forms, 2-3 minutes.", "Place 1 cake on a platter. Spread 1 1/4 cups frosting over. Place remaining cake on top. Cover top and sides of cake with remaining frosting. Garnish with chocolate chips and kisses. DO AHEAD: Cake can be made 2 days ahead. Cover and chill. Let stand at room temperature for 1 hour before serving."], "fat": 48.0, "date": "2012-09-18T04:00:00.000Z", "categories": ["Cake", "Chocolate", "Fruit", "Dessert", "Bake", "Kid-Friendly", "Tropical Fruit", "Banana", "Party", "Peanut Butter", "Bon Appétit", "Birthday", "Vegetarian", "Pescatarian", "Tree Nut Free", "Soy Free", "Kosher"], "calories": 766.0, "desc": "This cake is perfect for beginners—it's moist, forgiving, and easy. Jif creamy peanut butter is our favorite for the decadent frosting.", "protein": 12.0, "rating": 4.375, "title": "Banana-Chocolate Chip Cake With Peanut Butter Frosting ", "ingredients": ["Nonstick vegetable oil spray", "3 cups all-purpose flour", "2 teaspoons baking soda", "2 teaspoons kosher salt", "1 1/2 cups sugar", "1 cup (2 sticks) unsalted butter, room temperature", "1/2 cup (packed) light brown sugar", "3 large eggs", "1 1/2 teaspoons vanilla extract", "2 cups mashed very ripe bananas", "1 cup sour cream", "1 10-ounce bag mini chocolate chips", "2 cups creamy peanut butter", "1 1/2 cups powdered sugar", "1 cup (2 sticks) unsalted butter, room temperature", "2 1/2 teaspoons vanilla extract", "Chocolate chips, mini chocolate chips, and chocolate kisses", "Two 8x8x2\" cake pans"], "sodium": 439.0}, {"directions": ["Sprinkle steaks with salt and pepper. Heat oil in large skillet over medium-high heat. Add steaks; cook to desired doneness, about 5 minutes per side for medium-rare. Transfer steaks to platter. Add 2 tablespoons parsley and garlic to skillet; stir 30 seconds. Add broth, then brandy. Boil until juices are reduced to glaze, about 6 minutes. Spoon glaze over steaks. Sprinkle with remaining 1 tablespoon parsley."], "fat": 12.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Garlic", "Sauté", "Low Carb", "Quick & Easy", "Wheat/Gluten-Free", "Father's Day", "Beef Tenderloin", "Brandy", "Bon Appétit", "Massachusetts"], "calories": 174.0, "desc": "This recipe can be prepared in 45 minutes or less.", "protein": 11.0, "rating": 4.375, "title": "Beef Tenderloin with Garlic and Brandy ", "ingredients": ["4 6- to 7-ounce beef tenderloin steaks (each about 1 inch thick)", "1 tablespoon olive oil", "3 tablespoons chopped fresh parsley", "3 large garlic cloves, chopped", "2/3 cup canned beef broth", "2 tablespoons brandy"], "sodium": 176.0}, {"directions": ["Using the tip of a paring knife, score an X in the bottom of peach. Cook in a small saucepan of boiling water just until skin begins to peel back where cut, about 30 seconds. Transfer to a bowl of ice water; let cool. Peel and coarsely chop.", "Bring peach, sugar, vinegar, 1/2 teaspoon salt, and 2 tablespoons water to a boil in a small saucepan. Reduce heat and simmer, stirring occasionally, until peach is very soft and mixture thickens slightly, 5–8 minutes. Pulse in a blender until chunky (do not purée). Transfer to a medium bowl; let cool.", "Mix in Dijon and whole grain mustards and chives; season with salt and pepper."], "fat": 3.0, "date": "2014-06-17T04:00:00.000Z", "categories": ["Sauce", "Mustard", "Peach", "Chive", "Bon Appétit"], "calories": 134.0, "desc": "Where a chutney and mustard sauce overlap. Choose a very ripe– even bruised–peach for easy peeling.", "protein": 4.0, "rating": 3.125, "title": "Peach Mustard ", "ingredients": ["1 large ripe peach", "2 tablespoons sugar", "1 teaspoon apple cider vinegar", "1/2 teaspoon kosher salt, plus more", "1/3 cup Dijon mustard", "1/3 cup whole grain mustard", "1 tablespoon finely chopped fresh chives", "Freshly ground black pepper"], "sodium": 1394.0}, {"directions": ["Purée vegetable juice, spinach, and escarole (if using) in a blender until smooth. Add remaining ingredients and pulse to combine, leaving some texture.", "Chill soup, covered, until cold, about 1 hour."], "fat": 31.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Soup/Stew", "Garlic", "Onion", "No-Cook", "Vegetarian", "Spinach", "Winter", "Chill", "Healthy", "Escarole", "Gourmet"], "calories": 382.0, "desc": "This uncooked soup isn't for the timid — raw garlic, ginger, and shallot impart strong flavors. Unless you can get freshly made vegetable juice from your local juice bar, you will need an electric juicer to make the tomato or carrot juice.", "protein": 5.0, "rating": 4.375, "title": "Raw Cream of Spinach Soup ", "ingredients": ["2 cups fresh tomato and/or carrot juice (from about 1 lb vegetables)", "2 cups chopped spinach leaves", "2 tablespoons chopped escarole leaves (optional)", "1/2 medium California avocado, pitted and peeled", "1/2 cup olive oil", "1/3 cup packed fresh cilantro", "1/4 cup Nama Shoyu* (unpasteurized soy sauce) or 1 1/2 teaspoons sea salt (preferably Celtic)", "1/4 cup finely chopped shallot", "2 tablespoons chopped scallion", "2 tablespoons minced garlic", "2 tablespoons dry white wine", "1 tablespoon fresh lime juice", "1 tablespoon chopped fresh mint", "1 teaspoon minced fresh jalapeño, including seeds", "1 teaspoon minced peeled fresh ginger", "Garnish: 1 small portabella mushroom cap, halved and thinly sliced"], "sodium": 977.0}, {"directions": ["Butter and sugar six 2/3-to 3/4-cup ramekins. Bring 1 cup water and next 5 ingredients just to boil in medium saucepan, stirring occasionally. Gradually whisk in cornmeal. Reduce heat to low; stir until mixture is thick and creamy, about 2 minutes. Remove from heat. Stir in yolks.", "Beat egg whites and cream of tartar in medium bowl until soft peaks form. Stir 1/3 of whites into cornmeal mixture. Fold in remaining whites in 2 additions. Divide among ramekins. Place on rimmed baking sheet. DO AHEAD: Can be made 1 day ahead. Cover; chill.", "Preheat oven to 375°F. Bake spoon breads until almost set in center, about 22 minutes (26 minutes if chilled). Serve immediately with strawberry preserves."], "fat": 5.0, "date": "2008-12-04T04:00:00.000Z", "categories": ["Bread", "Milk/Cream", "Breakfast", "Brunch", "Dessert", "Bake", "Christmas", "Mother's Day", "New Year's Day", "Honey", "Jam or Jelly", "Bon Appétit", "Kidney Friendly", "Vegetarian", "Pescatarian", "Wheat/Gluten-Free", "Peanut Free", "Tree Nut Free", "Soy Free", "Kosher"], "calories": 146.0, "desc": "Classic spoon bread is a savory pudding served as a side dish. In this dessert version, the slightly sweetened batter is baked in individual ramekins, then topped with strawberry preserves.", "protein": 4.0, "rating": 1.875, "title": "Sweet Buttermilk Spoon Breads ", "ingredients": ["1 cup water", "2/3 cup buttermilk", "1/3 cup heavy whipping cream", "2 tablespoons plus 2 teaspoons sugar", "1/2 teaspoon honey", "1/4 teaspoon (scant) coarse kosher salt", "2/3 cup white cornmeal (not white grits)", "2 large eggs, separated", "Pinch of cream of tartar", "Strawberry preserves"], "sodium": 160.0}, {"directions": ["Put oven rack in lower third of oven and preheat oven to 350°F.", "Pat pork dry and sprinkle all over with salt. Heat olive oil in pot over moderately high heat until hot but not smoking, then brown pork on all sides, about 10 minutes total. Transfer to a plate. Add carrots, celery, and onion to pot and cook, stirring occasionally, until browned, about 10 minutes. Return pork to pot, along with bay leaves, spices, and water, and bring to a simmer. Cover pot with lid, then transfer to oven and braise, turning pork over once, until center is tender but not falling apart when pierced with a paring knife, 2 1/2 to 3 hours.", "Transfer pork to a cutting board and keep warm, loosely covered with foil. Pour braising liquid through a sieve into a bowl, discarding solids. Skim off fat and keep liquid warm, covered.", "Cut meat across the grain into 6 slices (each slice may break into 2 or 3 smaller pieces, depending on part of shoulder you have; discard string if necessary). Heat vegetable oil in a 12-inch heavy nonstick skillet over moderately high heat until hot but not smoking, then sear pork slices in 2 batches, turning over once, about 3 minutes per batch. Transfer to plates as browned and spoon some braising liquid over pork. Serve with remaining braising liquid."], "fat": 68.0, "date": "2007-02-14T21:13:14.000Z", "categories": ["Onion", "Pork", "Vegetable", "Braise", "Sauté", "Gourmet"], "calories": 890.0, "desc": "Pork all over Denmark is hauntingly tender. Ruggiero was particularly taken with the pork belly she tasted at the restaurant Gammel Mønt—crisp, but succulent and rich. To re-create these qualities, Ruggiero devised a version that requires minimal effort but promises stunning results: Pork shoulder is braised first, until it's super tender, and then flash-seared for a golden crust. The aroma alone will convince you that this unorthodox technique is entirely worthwhile.", "protein": 59.0, "rating": 4.375, "title": "Crisp Braised Pork Shoulder ", "ingredients": ["1 (4 1/2-lb) solid piece boneless pork shoulder (not lean; from picnic side)", "2 teaspoons salt", "1 tablespoon olive oil", "2 carrots, cut into 2-inch pieces", "2 celery ribs, cut into 2-inch pieces", "1 onion, cut into 2-inch pieces", "2 Turkish bay leaves or 1 California", "1/2 teaspoon black peppercorns", "1/2 teaspoon juniper berries", "1/2 teaspoon mustard seeds", "1/2 teaspoon coriander seeds", "1/4 teaspoon cumin seeds", "3 cups water", "2 tablespoons vegetable oil", "Special equipment: a wide 5- to 6-qt heavy pot with a tight-fitting lid"], "sodium": 1027.0}, {"directions": ["Preheat oven to 375°F. Oil baking sheet. Arrange peppers, cut side up, on sheet. Mix tomatoes and garlic in medium bowl. Season with salt and pepper. Fill pepper cavities with tomato mixture. Drizzle 1 teaspoon oil over each. Place 2 anchovy fillets atop each. Bake until peppers are tender, about 50 minutes.", "Arrange cheese atop peppers. Bake until cheese melts, about 3 minutes. Transfer peppers to platter. Sprinkle with basil and serve."], "fat": 7.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Cheese", "Fish", "Pepper", "Tomato", "Low Carb", "Summer", "Bon Appétit"], "calories": 107.0, "desc": null, "protein": 5.0, "rating": 5.0, "title": "Mozzarella-Topped Peppers with Tomatoes and Garlic ", "ingredients": ["2 small red bell peppers, halved lengthwise, seeded, stems left intact", "2 cups chopped seeded tomatoes", "2 teaspoons minced garlic", "4 teaspoons olive oil", "8 anchovy fillets, drained", "4 1/3-inch-thick slices drained fresh water-packed mozzarella or regular mozzarella", "1 tablespoon thinly sliced fresh basil"], "sodium": 344.0}, {"directions": ["Puree first 5 ingredients in blender until smooth. With machine running, gradually add vegetable oil, then olive oil. Season to taste with salt and pepper. DO AHEAD: Can be made 1 day ahead. Cover and chill.", "Cook asparagus in large skillet of boiling salted water until just tender, 4 to 5 minutes. Transfer asparagus to 13x9x2-inch pan of ice water to cool. Drain asparagus and pat dry. DO AHEAD: Can be made 8 hours ahead. Wrap in paper towels, then plastic, and chill.", "Place potatoes in large saucepan. Add enough water to cover potatoes by 1 inch. Sprinkle with salt. Bring to boil and cook until potatoes are tender, 10 to 15 minutes, depending on size of potatoes. Drain; let cool 5 minutes. Place in medium bowl. Add 1/4 cup vinaigrette; toss to coat. Season to taste with salt and pepper.", "Heat olive oil in small skillet over medium-high heat. Add capers and fry until capers are crisp and open like flowers, stirring often, 45 to 60 seconds. Using slotted spoon, transfer capers to paper towels to drain. DO AHEAD: Potatoes and capers can be made 2 hours ahead. Let stand at room temperature.", "Place asparagus in large bowl. Add 2 tablespoons vinaigrette and toss to coat. Toss potatoes again to coat, adding 1 more tablespoon vinaigrette if dry. Place greens and radishes in another large bowl. Toss with enough vinaigrette to coat. Spread greens and radishes over large platter. Arrange potatoes, asparagus, eggs, and tuna atop greens. Drizzle some vinaigrette over tuna. Sprinkle with fried capers and chive blossoms, if desired."], "fat": 33.0, "date": "2009-03-04T04:00:00.000Z", "categories": ["Potato", "High Fiber", "Lunch", "Tuna", "Asparagus", "Radish", "Spring", "Chive", "Capers", "Bon Appétit", "Pescatarian", "Dairy Free", "Wheat/Gluten-Free", "Peanut Free", "Tree Nut Free", "Soy Free", "Kosher"], "calories": 421.0, "desc": "A springy take on Niçoise salad, with radishes and asparagus in place of tomatoes and haricots verts.", "protein": 10.0, "rating": 5.0, "title": "Tuna, Asparagus, and New Potato Salad with Chive Vinaigrette and Fried Capers ", "ingredients": ["1/3 cup chopped fresh chives", "1/4 cup Champagne vinegar", "1 small shallot, coarsely chopped", "1 teaspoon honey", "1 teaspoon Dijon mustard", "2/3 cup vegetable oil", "1/3 cup extra-virgin olive oil", "1 1/2 pounds thick asparagus, stems peeled", "1 1/4 pounds baby red potatoes, halved or quartered", "1/3 cup olive oil", "1/2 cup capers, drained, patted dry", "8 ounces mixed spring greens", "16 large radishes, trimmed, very thinly sliced (about 3 cups)", "3 large hard-boiled eggs, peeled, quartered", "12 ounces imported tuna packed in oil, drained", "Chive blossoms (optional)"], "sodium": 383.0}, {"directions": ["Blend all dressing ingredients in a blender until smooth.", "Peel pear and cut into 1/8- to 1/4-inch-thick julienne, then transfer to a bowl.", "Combine watercress and pear in a bowl, then season with salt and pepper and toss gently. Divide among plates, then drizzle with some dressing and sprinkle with carrot."], "fat": 19.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Salad", "Ginger", "No-Cook", "Vegetarian", "Fall", "Asian Pear", "Watercress", "Sesame", "Gourmet"], "calories": 345.0, "desc": "Active time: 20 min Start to finish: 20 min", "protein": 11.0, "rating": 4.375, "title": "Asian Pear and Watercress Salad with Sesame Dressing ", "ingredients": ["1 (1/2-inch-thick) slice peeled fresh ginger", "1/4 cup Asian sesame paste* or smooth peanut butter", "3 tablespoons Asian sesame oil*", "1/4 cup rice vinegar (not seasoned)", "1 1/2 tablespoons sugar", "2 tablespoons water", "1 teaspoon Asian chile paste with garlic*", "1/2 teaspoon salt", "1 1/2 lb Asian pear (1 large or 2 medium)", "4 cups trimmed watercress sprigs (from 2 bunches; 10 oz)", "1 carrot, finely shredded", "*Available at some Asian markets and by mail order from Ethnic Grocer (800-523-1961)."], "sodium": 423.0}, {"directions": ["Preheat oven to 400°F. In a shallow bowl, combine breadcrumbs, paprika, garlic salt, and red pepper. Pour buttermilk into a separate shallow bowl. Dip chicken in buttermilk, then dredge in breadcrumb mixture. Place chicken, meaty side up, in a large baking pan. Generously coat chicken pieces with cooking spray. Bake for 40 minutes or until done. Check internal cooking temperature of chicken with a meat thermometer until breasts reach 170°F and thighs reach 180°F."], "fat": null, "date": "2006-05-16T20:10:20.000Z", "categories": ["Chicken", "Bake", "Low Fat", "Kid-Friendly", "Self"], "calories": null, "desc": "Nashville: Try the \"fried\" chicken, y'all. Southern hospitality wouldn't be quite so hospitable without corn bread, collard greens, and, of course, fried chicken. If you haven't already guessed that grease is what's so \"finger-lickin' good,\" we'll let you in on a secret: You can spend nearly half a day's calories on one thigh of this Southern-fried favorite. So make our baked version instead.", "protein": null, "rating": 3.75, "title": "\"Fried\" Chicken ", "ingredients": ["3 cups Italian-style breadcrumbs", "2 tbsp paprika", "2 tbsp garlic salt", "1 tbsp ground red pepper", "2 cups 1.5 percent buttermilk", "12 chicken pieces (6 breast halves, 6 thighs), skinless", "Butter-flavored cooking spray"], "sodium": null}, {"directions": ["Preheat oven to 400°F. Place parchment squares on work surface. Generously butter half of each parchment square; top buttered half of each with 1 fish fillet. Sprinkle fish with salt and pepper; top each fillet with 3 tarragon leaves, then 1 piece of butter. Arrange asparagus around each fish fillet; pour 1 tablespoon orange juice over each. Fold parchment over fish and asparagus, folding and crimping edges tightly to seal and enclose filling completely. Place on 2 rimmed baking sheets, spacing apart. do ahead Can be made 4 hours ahead. Chill.", "Bake fish packets 17 minutes. Slide packets onto plates and serve."], "fat": null, "date": "2008-02-27T21:40:23.000Z", "categories": ["Fish", "Bake", "Low Carb", "Quick & Easy", "Low Cal", "Low Sodium", "Dinner", "Cod", "Halibut", "Asparagus", "Healthy", "Bon Appétit"], "calories": null, "desc": "In this delicately flavored main course, the asparagus steams along with the fish in individual paper packets.", "protein": null, "rating": 3.75, "title": "Fish Fillets in Parchment with Asparagus and Orange ", "ingredients": ["4 15x15-inch squares parchment paper", "4 5-to 6-ounce fish fillets (such as halibut or cod; each about 1 inch thick)", "12 fresh tarragon leaves", "2 tablespoons butter, cut into 4 pieces", "1 pound slender asparagus spears, trimmed, cut into 1 1/2-inch pieces", "4 tablespoons orange juice"], "sodium": null}, {"directions": ["Heat oil in heavy large skillet over medium heat. Add pancetta, celery, and onion. Sauté until vegetables are soft but not brown, about 12 minutes. Transfer 1/2 cup sliced Treviso to small bowl and reserve for topping. Add remaining Treviso, 2 teaspoons thyme, and garlic to skillet. Toss until Treviso wilts, about 3 minutes. Season filling with salt and pepper.", "Cook lasagna noodles in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain noodles. Arrange noodles in single layer on large sheet of plastic wrap; cover with second sheet to avoid drying. DO AHEAD: Filling and pasta can be made 2 hours ahead. Let stand at room temperature.", "Melt butter in heavy medium saucepan over medium-low heat. Add flour and whisk until roux is pale gold color, about 2 minutes. Gradually whisk in milk; add nutmeg and white pepper. Increase heat to medium and cook until sauce thickens and boils, whisking often, 2 to 3 minutes. Reduce heat to low. Add Taleggio cheese in 4 batches, whisking to melt before adding more, about 4 minutes. Season sauce to taste with salt and pepper.", "Spoon 1/2 cup sauce into 13 x 9 x 2-inch glass baking dish; spread to cover bottom thinly. Arrange 3 noodles, crosswise and side by side, in dish; trim ends if necessary to fit. Transfer 3/4 cup filling to another small bowl and reserve for topping. Spoon half of remaining filling over noodles. Drizzle with 2/3 cup sauce; sprinkle with 1/4 cup Parmesan cheese. Repeat with noodles, filling, sauce, and Parmesan. Top with third layer of noodles; drizzle with 2/3 cup sauce. Spoon reserved 3/4 cup filling down center of lasagna lengthwise in 2-inch-wide strip. Drizzle strip with remaining sauce, then top with breadcrumbs. DO AHEAD: Can be made 1 day ahead. Cover and chill. Let stand at room temperature 1 hour before continuing.", "Preheat oven to 375°F. Bake lasagna uncovered until heated through and sauce is bubbling, about 35 minutes. Remove from oven; let cool 15 minutes.", "Toss reserved Treviso in small bowl with splash of olive oil and sprinkle of salt and pepper. Sprinkle over strip of filling. Sprinkle with remaining 1 teaspoon thyme."], "fat": null, "date": "2009-11-02T04:00:00.000Z", "categories": ["Milk/Cream", "Cheese", "Leafy Green", "Pasta", "Bake", "Sauté", "High Fiber", "Dinner", "Parmesan", "Bacon", "Family Reunion", "Endive", "Breadcrumbs", "Bon Appétit"], "calories": null, "desc": null, "protein": null, "rating": 3.75, "title": "Pancetta and Taleggio Lasagna with Treviso ", "ingredients": ["3 tablespoons extra-virgin olive oil", "8 ounces thinly sliced pancetta (Italian bacon), chopped", "2 cups thinly sliced celery hearts", "1 2/3 cups chopped onion", "1 pound Treviso radicchio or red endive (4 medium heads), quartered lengthwise, cored, then cut on diagonal into thin strips (about 6 cups), divided", "3 teaspoons chopped fresh thyme, divided", "1 garlic clove, finely chopped", "9 lasagna noodles (each 7 x 3 inches)", "1/4 cup (1/2 stick) unsalted butter", "2 1/2 tablespoons all purpose flour", "2 cups whole milk", "Pinch of ground nutmeg", "Pinch of ground white pepper", "12 ounces Taleggio cheese,* rind removed, cheese cut into 1/2-inch cubes", "1/2 cup finely grated Parmesan cheese, divided", "2 tablespoons coarse dry breadcrumbs (preferably from crustless Italian bread)", "Olive oil"], "sodium": null}, {"directions": ["Preheat oven to 325°F. Toss pecans and melted butter in medium bowl to coat. Add sea salt and toss. Spread pecans in single layer on rimmed baking sheet.", "Bake until fragrant and slightly darkened in color, about 15 minutes. Cool pecans on baking sheet."], "fat": 30.0, "date": "2007-01-18T04:25:29.000Z", "categories": ["Nut", "Bake", "Cocktail Party", "Super Bowl", "Quick & Easy", "Pecan", "Fall", "Winter", "Shower", "Bon Appétit"], "calories": 279.0, "desc": null, "protein": 3.0, "rating": 3.75, "title": "Sea Salt-Roasted Pecans ", "ingredients": ["2 cups pecan halves", "3 tablespoons unsalted butter, melted", "1 1/4 teaspoons fine sea salt"], "sodium": 206.0}, {"directions": ["Mince garlic and mash to a paste with a pinch of salt, then transfer to a bowl and stir in oil, salt, and pepper. Add baguette crumbs and stir until combined well."], "fat": 7.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Bread", "Condiment/Spread", "Fry", "No-Cook", "Quick & Easy", "Winter", "Pan-Fry", "Gourmet"], "calories": 95.0, "desc": null, "protein": 1.0, "rating": 0.0, "title": "Garlic Baguette Crumbs ", "ingredients": ["1 garlic clove", "2 tablespoons olive oil", "1/4 teaspoon salt", "1/4 teaspoon black pepper", "1 cup toasted baguette crumbs"], "sodium": 103.0}, {"directions": ["Gently combine the eggs, cucumbers, shallots, green onions, and basil in a medium bowl. Stir in the mayonnaise, salt, and pepper.", "Store in the refrigerator for up to three days."], "fat": 20.0, "date": "2011-03-31T04:00:00.000Z", "categories": ["Egg", "Herb", "Vegetable", "Side", "Easter", "Vegetarian", "Mother's Day", "Father's Day", "Dinner", "Lunch", "Basil", "Cucumber", "Spring", "Summer", "Shower", "Chill", "Party", "Boil", "Advance Prep Required", "Sugar Conscious", "Kidney Friendly", "Pescatarian", "Paleo", "Dairy Free", "Wheat/Gluten-Free", "Peanut Free", "Tree Nut Free", "Soy Free", "Kosher"], "calories": 215.0, "desc": "The glories of summer are captured in this pale green egg salad redolent of fresh basil, green onions, and crunchy cucumbers. Serve it surrounded by greens or tucked into pita loaves or slices of crusty bread for a satisfying lunch.", "protein": 6.0, "rating": 3.75, "title": "Cucumber-Basil Egg Salad ", "ingredients": ["6 hard-cooked eggs, diced (2 cups)", "3/4 cup seeded, diced cucumbers (about 1/2 cucumber)", "1/4 cup minced shallots", "1/2 cup sliced green onions (green part only)", "3 tablespoons lightly packed chopped fresh basil", "1/2 cup mayonnaise", "1/4 teaspoon kosher salt", "1/4 teaspoon freshly ground pepper"], "sodium": 250.0}, {"directions": ["Preheat oven to 275°F. Mix sugar and spices in small bowl. Place pear slices on rack set over baking sheet. Sprinkle with spiced sugar. Bake until almost dry, about 1 hour. Cool. Store airtight up to 2 days."], "fat": 0.0, "date": "2007-07-26T17:36:37.000Z", "categories": ["Bake", "Kid-Friendly", "Pear", "Spice", "Healthy", "Bon Appétit"], "calories": 14.0, "desc": "Use a V-slicer (a simple, inexpensive version of a mandoline available at cookware stores) for the paper-thin pear slices.", "protein": 0.0, "rating": 2.5, "title": "Dried Pear Crisps ", "ingredients": ["1 tablespoon sugar", "1/4 teaspoon ground ginger", "1/4 teaspoon cinnamon", "20 paper-thin pear slices (from 1 pear)"], "sodium": 0.0}, {"directions": ["Halve the potatoes, unpeeled, and cut them into 1-inch wedges. In a large roasting pan heat 1/3 cup of the oil in the middle of a preheated 425°F. oven for 5 minutes, add the potatoes, tossing them to coat them with the oil, and roast them, stirring them every 10 minutes, for 30 minutes, or until they are tender. Let the potatoes cool in the pan. In a blender purée the garlic, the vinegar, the rosemary leaves, and salt to taste, with the motor running add the remaining 1/3 cup oil in a stream, and blend the dressing until it is emulsified. In a small bowl of ice and cold water let the onion soak for 5 minutes, drain it well, and pat it dry. In a kettle of boiling salted water boil the green beans for 5 minutes, or until they are crisp-tender, and drain them in a colander. Refresh the beans under cold water and pat them dry. In a very large bowl combine the potatoes, the onion, the green beans, and the olives, add the dressing, and toss the salad gently. Serve the salad, garnished with the rosemary sprigs, at room temperature."], "fat": 19.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Salad", "Blender", "Olive", "Onion", "Potato", "Side", "Roast", "Vegetarian", "Rosemary", "Green Bean", "Summer", "Vegan", "Boil", "Gourmet", "Pescatarian", "Dairy Free", "Wheat/Gluten-Free", "Peanut Free", "Tree Nut Free", "Soy Free", "No Sugar Added", "Kosher"], "calories": 351.0, "desc": null, "protein": 6.0, "rating": 4.375, "title": "Green Bean, Red Onion, and Roast Potato Salad with Rosemary Vinaigrette ", "ingredients": ["3 pounds red boiling potatoes", "2/3 cup olive oil", "1 garlic clove", "1/4 cup red-wine vinegar", "1 tablespoon fresh rosemary leaves or 1 teaspoon crumbled dried, plus rosemary sprigs for garnish", "1 red onion, halved lengthwise and sliced thin lengthwise", "2 pounds green beans, trimmed and cut into 1-inch pieces", "24 Kalamata or Niçoise olives, pitted and halved"], "sodium": 79.0}, {"directions": ["Preheat oven to 425°F. Lightly spray heavy baking sheet with vegetable oil spray.", "Mix buttermilk, orange peel and nutmeg in small bowl. Mix flour, sugar, baking powder, baking soda and salt in large bowl. Add shortening and butter to flour mixture and rub in with fingertips until mixture resembles coarse meal. Add buttermilk mixture and stir until soft dough forms. Turn dough out onto lightly floured surface and gently knead until smooth, about 4 to 5 turns. Pat dough into 6x4-inch rectangle. Cut dough into 6 equal squares.", "Transfer biscuits to prepared baking sheet. Bake until puffed and golden, about 12 minutes. Transfer to rack and cool slightly. (Can be made 4 hours ahead. Cool completely. Before serving, cover with foil and rewarm in 350°F oven 5 minutes.)", "Mix water and cornstarch in small bowl to blend. Bring nectar, sugar and lemon juice to boil in heavy medium saucepan. Whisk in cornstarch mixture. Bring to boil, stirring constantly. Mix in apricots, cherries and vanilla. Reduce heat to medium and stir until sauce thickens slightly and fruit is warmed through, about 1 minute.", "Cut warm biscuits horizontally in half. Place 1 bottom onto each of 6 plates. Spoon half of fruit mixture over, dividing equally. Place tops over fruit. Spoon remaining fruit mixture over each."], "fat": 5.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Fruit", "Dessert", "Bake", "Apricot", "Cherry", "Summer", "Bon Appétit", "Vegetarian", "Pescatarian", "Peanut Free", "Tree Nut Free", "Soy Free", "Kosher"], "calories": 311.0, "desc": "Here's a terrific light version of an American summer classic.", "protein": 5.0, "rating": 4.375, "title": "Apricot-Cherry Shortcakes ", "ingredients": ["Nonstick vegetable oil spray", "1/2 cup low-fat buttermilk", "1 1/2 teaspoons grated orange peel", "1/2 teaspoon ground nutmeg", "1 1/4 cups all purpose flour", "3 tablespoons sugar", "1/2 teaspoon baking powder", "1/2 teaspoon baking soda", "1/8 teaspoon salt", "1 tablespoon chilled vegetable shortening, cut into small pieces", "1 tablespoon chilled unsalted butter, cut into small pieces", "1 tablespoon water", "2 teaspoons cornstarch", "1 11 1/2-ounce can apricot nectar", "3 tablespoons sugar", "1 teaspoon fresh lemon juice", "1 pound apricots, quartered, pitted", "1 pound Bing cherries, halved, pitted", "1/2 teaspoon vanilla extract"], "sodium": 226.0}, {"directions": ["Preheat oven to 375°F. Whisk chili sauce, soy sauce, balsamic vinegar, and ginger in medium bowl; add steaks and turn to coat. Let marinate at room temperature 15 minutes, turning occasionally.", "Heat 1/2 tablespoon vegetable oil in large ovenproof skillet over medium-high heat. Scrape most of marinade off steaks and back into bowl. Sprinkle steaks with salt and pepper; add to skillet and cook until browned, about 3 minutes. Turn steaks over and transfer skillet to oven. Roast until cooked to desired doneness, about 5 minutes longer for medium-rare. Transfer steaks to cutting board; let rest 10 minutes.", "Meanwhile, heat remaining 1 tablespoon vegetable oil in heavy medium skillet over medium-high heat. Add onion and bell peppers; sauté until crisp-tender, about 3 minutes. Add green onions and all remaining marinade from steaks. Bring to boil. Stir in cilantro. Cut steaks crosswise in half. Divide steaks among 4 plates. Spoon vegetables over steaks and serve.", "*A sweet-hot Thai-style condiment used in marinades and sauces; available in the Asian foods section of some supermarkets and at Asian markets."], "fat": null, "date": "2008-09-29T04:00:00.000Z", "categories": ["Stir-Fry", "Kid-Friendly", "Low Cal", "Back to School", "Dinner", "Steak", "Bell Pepper", "Poker/Game Night", "Bon Appétit", "Dairy Free", "Peanut Free", "Tree Nut Free", "No Sugar Added"], "calories": null, "desc": "A steakhouse take on Thai beef with peppers. Serve with steamed rice.", "protein": null, "rating": 4.375, "title": "Asian Steak Topped with Bell Pepper Stir-Fry ", "ingredients": ["2 tablespoons Thai-style chili sauce*", "1 1/2 tablespoons soy sauce", "2 teaspoons balsamic vinegar", "2 teaspoons grated peeled fresh ginger", "2 10- to 12-ounce New York steaks", "1 1/2 tablespoons vegetable oil, divided", "1 medium onion, halved, sliced", "2 medium red bell peppers, cut into", "4 green onions, chopped", "1/2 cup chopped fresh cilantro"], "sodium": null}, {"directions": ["Blanch 6 lemons in boiling water 5 minutes, then drain. Cut each lemon into 8 wedges and discard seeds. Toss with kosher salt in a bowl, then firmly pack with salt into jar.", "Squeeze enough juice from remaining lemons to measure 1 cup. Add enough juice to cover lemons and screw on lid. Let stand at room temperature, shaking jar gently once a day, 5 days. Add oil to lemons and chill, covered."], "fat": null, "date": "2008-04-16T21:03:11.000Z", "categories": ["Lemon", "Boil", "Gourmet", "Australia"], "calories": null, "desc": "Preserved lemons are perhaps most at home in Moroccan dishes, but we love their complex, bright flavor and aroma in all kinds of soups, stews, and salads. We've adapted Mediterranean-food authority Paula Wolfert's quick method and made it even faster by blanching the lemons first. If you manage to find Meyer lemons, this is a great way to capture their unforgettable taste and perfume.", "protein": null, "rating": 5.0, "title": "Moroccan-Style Preserved Lemons ", "ingredients": ["10 to 12 lemons (2 1/2 to 3 lb)", "2/3 cup kosher salt", "1/4 cup extra-virgin olive oil", "a 4- to 6-cup jar with a tight-fitting lid"], "sodium": null}, {"directions": ["Put oven rack in upper third of oven and preheat oven to 450°F.", "Peel sweet potatoes, then cut each lengthwise into 6 spears. Cut spears in half crosswise if desired, then arrange in 1 layer in a large (17- by 12-inch) shallow baking pan.", "Cook bacon in a 10-inch heavy skillet over moderate heat, stirring, until browned and crisp, 10 to 15 minutes. Transfer with a slotted spoon to paper towels to drain, then pour bacon fat through a fine-mesh sieve onto potato spears and toss with 2 spatulas to coat. Sprinkle spears with 1/2 teaspoon salt and 1/4 teaspoon pepper and roast (uncovered), turning every 15 to 20 minutes, until potatoes are tender and edges are browned, 45 minutes to 1 hour. Transfer to a serving dish.", "Return bacon to cleaned skillet, then add oil and heat over moderate heat until hot but not smoking. Stir in white part of scallions and remove from heat. Stir in vinegar, water, remaining 1/2 teaspoon salt, and remaining 1/4 teaspoon pepper and pour over potato spears. Sprinkle potatoes with scallion greens and serve warm."], "fat": 18.0, "date": "2006-10-19T04:19:58.000Z", "categories": ["Onion", "Side", "Roast", "Thanksgiving", "Vinegar", "Bacon", "Sweet Potato/Yam", "Fall", "Gourmet", "Paleo", "Dairy Free", "Wheat/Gluten-Free", "Peanut Free", "Tree Nut Free", "Soy Free", "No Sugar Added"], "calories": 376.0, "desc": "Don't be surprised if these spears prove even more popular than the classic mash—they brown up beautifully, and it's hard to resist the siren call of bacon.", "protein": 7.0, "rating": 4.375, "title": "Roasted Sweet-Potato Spears with Bacon Vinaigrette ", "ingredients": ["4 pounds medium sweet potatoes (about 7)", "1/2 pound sliced bacon, cut crosswise into 1/2-inch-wide strips", "1 teaspoon salt", "1/2 teaspoon black pepper", "1/4 cup extra-virgin olive oil", "3 scallions, thinly sliced, reserving sliced greens separately", "2 tablespoons Sherry vinegar", "1 tablespoon water"], "sodium": 604.0}, {"directions": ["In a food processor grind the ham until it is minced, add the mustard, the butter, the honey, and the cloves, and blend the mixture until it is smooth. Transfer the mixture into a bowl and stir in the onion, the pickle, and pepper to taste. Serve the deviled ham with crackers or as a sandwich filling."], "fat": 13.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Food Processor", "Mustard", "Onion", "Quick & Easy", "Ham", "Spring", "Gourmet"], "calories": 185.0, "desc": "Can be prepared in 45 minutes or less.", "protein": 10.0, "rating": 3.125, "title": "Deviled Ham ", "ingredients": ["3/4 pound cooked ham, cut into pieces", "1/4 cup Dijon-style mustard", "1/2 stick (1/4 cup) unsalted butter, softened", "1 tablespoon honey", "1/4 teaspoon ground cloves", "3 tablespoons minced onion", "3 tablespoons minced sweet pickle"], "sodium": 765.0}, {"directions": ["Heat oven to 375°. On a parchment paper-lined baking sheet, shape Parmesan into 8 2-inch rounds. Bake until golden, 10 minutes; remove from sheet to cool. Cook pasta as directed on package; set aside. In a medium skillet over medium heat, melt 2 teaspoons butter. Cook whole sage leaves until crisp, 45 seconds. Transfer to a paper towel-lined plate, reserving butter. In the same skillet over medium heat, melt remaining 2 tablespoons butter. Add flour and cook, whisking constantly, until light brown, 1 minute. Slowly whisk in milk and cook, 5 minutes. Add squash, garlic, reserved butter and salt. Cover; simmer until squash is very soft, 25 minutes. In a food processor, puree squash mixture. In a pot over medium-low heat, heat squash puree, Fontina, Swiss, chopped sage and cayenne; stir until cheese melts. Stir in pasta. Serve with Parmesan crisps and sage leaves."], "fat": null, "date": "2013-11-13T04:00:00.000Z", "categories": ["Cheese", "Herb", "Pasta", "Low Cal", "Dinner", "Lunch", "Casserole/Gratin", "Parmesan", "Squash", "Butternut Squash", "Swiss Cheese", "Sage", "Fontina", "Simmer", "Boil", "Self", "Vegetarian", "Pescatarian", "Peanut Free", "Tree Nut Free", "Soy Free", "No Sugar Added", "Kosher"], "calories": null, "desc": "\"Creamy squash and cheese crisps only make you think you're off the diet cliff!\" says James Beard award winner Laura Werlin, author of Mac & Cheese, Please! and The All American Cheese and Wine Book.", "protein": null, "rating": 5.0, "title": "Fontina Mac with Squash and Sage ", "ingredients": ["6 tablespoons shredded Parmesan", "8 ounces shell pasta", "2 tablespoons plus 2 teaspoons butter, divided", "12 whole fresh sage leaves, plus 2 tablespoons, finely chopped", "2 tablespoons all-purpose flour", "3 cups 1 percent milk", "1 1/2 pounds butternut squash, peeled, seeded and cut into 1/2-inch pieces", "2 cloves garlic, chopped", "1/2 tsp salt", "2 cups shredded Fontina", "1 1/3 cups reduced-fat shredded Swiss cheese", "1/4 teaspoon cayenne pepper"], "sodium": null}, {"directions": ["Melt 2 tablespoons butter with vegetable oil in heavy large skillet over medium-high heat. Add all onions; cook until deep brown, stirring often, about 8 minutes. Add sugar and sauté until sugar dissolves, about 1 minute. Add 1/2 cup vinegar; sauté until almost all liquid evaporates, about 1 minute. Transfer to small bowl.", "Preheat oven to 200°F. Mix salt, 1/2 teaspoon cumin, and pepper in small bowl. Rub chicken breasts all over with spice mixture. Heat 2 teaspoons olive oil in heavy large skillet over medium-high heat; add chicken breasts, skin side down. Sauté until cooked through, about 4 minutes per side. Transfer chicken to baking sheet. Keep warm in oven.", "Heat remaining 2 teaspoons olive oil in same skillet over medium heat. Add garlic and sauté 20 seconds. Add caramelized onions, 1/4 cup vinegar, tomato, olives, capers, and Sherry. Cook until liquid reduces slightly, stirring constantly, about 2 minutes. Stir in 1 1/2 teaspoons cumin, chicken broth, lime juice, sage, thyme, and rosemary. Add avocado; cook until sauce thickens, stirring constantly, about 3 minutes. Reduce heat to low. Add 4 tablespoons butter and stir until blended into sauce. Season with salt and pepper. Place 1 chicken breast on each of 6 plates; spoon sauce over."], "fat": 44.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Chicken", "Olive", "Onion", "Sauté", "Dinner", "Vinegar", "Spice", "Avocado", "Fortified Wine", "Fall", "Capers", "Bon Appétit", "Wheat/Gluten-Free", "Peanut Free", "Tree Nut Free", "Soy Free"], "calories": 625.0, "desc": null, "protein": 39.0, "rating": 3.75, "title": "Aztec Chicken ", "ingredients": ["6 tablespoons (3/4 stick) chilled butter", "3 tablespoons vegetable oil", "1 large red onion, halved lengthwise, thinly sliced crosswise", "1/2 yellow onion, thinly sliced", "1 1/2 tablespoons sugar", "3/4 cup Sherry wine vinegar", "1 tablespoon coarse kosher salt", "2 teaspoons ground cumin", "1/4 teaspoon ground black pepper", "6 boneless chicken breast halves with skin", "4 teaspoons olive oil", "4 garlic cloves, thinly sliced", "1 large tomato, peeled, seeded, diced", "1/4 cup coarsely chopped pitted oil-cured black olives", "1/4 cup drained capers, rinsed", "1/4 cup Sherry", "1/3 cup low-salt chicken broth", "1/4 cup fresh lime juice", "1 tablespoon chopped fresh sage", "1 tablespoon chopped fresh thyme", "1 teaspoon minced fresh rosemary", "1 ripe avocado, halved, pitted, peeled, cut into 1/2-inch cubes"], "sodium": 1248.0}, {"directions": ["Whisk flour, salt, and yeast in medium bowl to blend well. Add lard and rub in with fingertips until mixture resembles coarse meal. Make well in center of mixture and pour wine into well. Stir with fork until shaggy dough forms. Gather dough together and turn out onto lightly floured work surface. Knead dough until smooth and elastic, adding warm water by teaspoonfuls if dough is dry, about 10 minutes.", "Line large baking sheet with parchment paper. Roll out dough on lightly floured surface to 1/8-inch thickness. Using fluted pastry wheel, cut dough into 1 1/4-inch-wide by 4-inch-long strips. Gently twist each strip in center, forming bow. Place pastry twists on prepared baking sheet. Reroll dough scraps to 1/8-inch thickness and cut out additional strips. Twist strips and place on prepared baking sheet.", "Pour enough olive oil into large saucepan to reach depth of 1 1/2 inches. Attach deep-fry thermometer to side of pan with bulb submerged in oil; heat oil to 360°F. Working in batches, fry dough twists in oil until golden on all sides, turning occasionally, 2 to 3 minutes. Using slotted spoon, transfer fried pastries to paper towels to drain. Cool completely. DO AHEAD: Can be made 1 day ahead. Store airtight at room temperature.", "Line another large baking sheet with parchment paper. Bring honey to simmer in medium saucepan. Remove from heat. Cool until just warm. Whisk powdered sugar, cinnamon, and nutmeg in medium bowl to blend.", "Working with 1 fried pastry at a time, dip pastry into warm honey. Lift pastry and shake gently, allowing excess honey to drip back into pan. Roll pastry in powdered sugar mixture to coat. Place on prepared baking sheet. Arrange pastries on platter.", "For the best results, dip the pastry twists in a mild-flavored honey, such as orange blossom. An assertively flavored honey will overwhelm the pastry and the spiced powdered sugar.", "Finish the meal with a glass of Moscato, a sweet white wine. Donatella recommends the 2007 Rivera \"Piani di Tufara\" Moscato di Trani, Dolce (Italy, $15). The wine's spicy raisin notes are complemented by bitter almond flavors and an apricot finish. If that bottle is unavailable, try the 2008 Michele Chiarlo Nivole Moscato D'Asti (Italy, $16), a sparkling Moscato with stone-fruit flavors."], "fat": null, "date": "2010-04-06T04:00:00.000Z", "categories": ["Dessert", "White Wine", "Family Reunion", "Deep-Fry", "Cinnamon", "Bon Appétit", "Kidney Friendly", "Dairy Free", "Peanut Free", "Tree Nut Free", "Soy Free"], "calories": null, "desc": "Donatella still remembers the lure of these addictive sweets. \"I always got in trouble with my aunt because I would sneak into the kitchen and steal them,\" she says. Frying the dough in extra-virgin olive oil adds an authentic flavor. You'll need about five cups of oil for frying.", "protein": null, "rating": 0.0, "title": "Pastry Twists with Spiced Sugar-Honey Glaze ", "ingredients": ["1 1/2 cups all purpose flour", "1/4 teaspoon (generous) salt", "1/8 teaspoon (generous) active dry yeast", "1/4 cup lard, cut into 1/2-inch cubes, room temperature", "1/2 cup dry white wine, room temperature", "Extra-virgin olive oil (for frying)", "1 cup honey", "1 cup powdered sugar", "1 tablespoon ground cinnamon", "1/2 teaspoon ground nutmeg", "Special equipment: Fluted pastry wheel"], "sodium": null}, {"directions": ["Cut off and discard 1 inch from stem ends of broccoli rabe. Cook broccoli rabe, uncovered, in 2 batches in a 6- to 8-quart pot of boiling salted water until just tender, about 3 minutes, transferring with a slotted spoon to a large bowl of ice and cold water to stop cooking. Drain well in a colander.", "Cook garlic in oil in a 12-inch nonstick skillet over moderate heat, stirring occasionally, until garlic is golden, about 5 minutes. Add broccoli rabe and cook, tossing to coat with oil, until heated through, 3 to 5 minutes. Toss broccoli rabe with salt."], "fat": 10.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Garlic", "Side", "Sauté", "Vegetarian", "Quick & Easy", "Vegan", "Broccoli Rabe", "Boil", "Gourmet", "Sugar Conscious", "Kidney Friendly", "Pescatarian", "Paleo", "Dairy Free", "Wheat/Gluten-Free", "Peanut Free", "Tree Nut Free", "Soy Free", "No Sugar Added", "Kosher"], "calories": 107.0, "desc": "Active time: 25 min Start to finish: 30 min", "protein": 4.0, "rating": 4.375, "title": "Sauteed Broccoli Rabe ", "ingredients": ["2 lb broccoli rabe", "3 large garlic cloves, thinly sliced lengthwise", "1/3 cup extra-virgin olive oil", "1 teaspoon salt (preferably sea salt), or to taste", "Accompaniment: lemon wedges"], "sodium": 329.0}, {"directions": ["Working off heat, put 1 tablespoon oil in a 10-inch nonstick skillet and add fish, turning to coat with oil on both sides. Arrange fish skinned sides down and sprinkle with salt and pepper.", "Toss together tomato, garlic (if using), basil, remaining tablespoon oil, and salt and pepper to taste in a small bowl, then mound on top of fish. Cover skillet with a tight-fitting lid and cook fish over moderately high heat until just cooked through, about 8 minutes."], "fat": 16.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Fish", "Tomato", "Quick & Easy", "Summer", "Gourmet"], "calories": 336.0, "desc": null, "protein": 44.0, "rating": 4.375, "title": "Grouper with Tomato and Basil ", "ingredients": ["2 tablespoons extra-virgin olive oil", "1 (1-lb) piece grouper or red snapper fillet (3/4 inch thick), skinned and halved crosswise", "1/4 teaspoon salt", "1/8 teaspoon black pepper", "1/2 cup coarsely chopped tomato", "1 small garlic clove, minced (optional)", "2 tablespoons thinly sliced fresh basil", "Accompaniment: fresh corn spoon bread"], "sodium": 413.0}, {"directions": ["Whisk together flour (2 cups), sugar, salt, and yeast in a bowl until combined. Whisk together water, oil, and egg in another bowl until combined well, then stir into flour mixture until a shaggy dough forms. Turn out dough onto a lightly floured surface and knead, working in just enough additional flour to keep dough from sticking, about 2 minutes (dough will not be smooth). Form dough into a ball and put in an oiled bowl, turning to coat, then let rest in bowl, uncovered, in a warm draft-free place 10 minutes.", "Cut dough into 10 pieces and form each into a ball. Working with 1 piece at a time, flatten balls, then roll out into 6-inch rounds (less than 1/8 inch thick) on lightly floured surface with a lightly floured rolling pin.", "Preheat grill pan or skillet over moderately high heat just until smoking, then reduce heat to moderate and grill bread rounds, 1 at a time, turning once, until marks appear and bread is cooked through, about 2 minutes. Keep breads warm, wrapped in a cloth napkin."], "fat": 6.0, "date": "2006-07-24T18:27:47.000Z", "categories": ["Bread", "Side", "Vegetarian", "Grill", "Grill/Barbecue", "Gourmet", "Sugar Conscious", "Kidney Friendly", "Pescatarian", "Dairy Free", "Peanut Free", "Tree Nut Free", "Soy Free", "Kosher"], "calories": 145.0, "desc": "Cooking these flatbreads in a grill pan gives them a smoky flavor. They can be served with hummus or the Lebanese Lamb and Bean Stew. Don't expect a pocket — they are like rustic tortillas.", "protein": 3.0, "rating": 2.5, "title": "Better-Than-Pita Grill Bread ", "ingredients": ["2 cups all-purpose flour plus additional for dusting", "1 teaspoon sugar", "1 teaspoon salt", "1/2 teaspoon fast-acting yeast from 1 (1/4-oz) package such as Fleischmann's Rapid Rise yeast", "1/4 cup plus 1 tablespoon warm water (105-115°F)", "1/4 cup canola or vegetable oil", "1 tablespoon beaten egg", "Special equipment: a lightly oiled ridged grill pan, cast-iron skillet, or griddle"], "sodium": 208.0}, {"directions": ["Position rack in middle of oven; preheat to 350°F. Spread coconut in a single layer on a rimmed baking sheet and toast until golden brown and aromatic, 3–5 minutes. Let cool 5 minutes.", "Meanwhile, coat a 13x9\" pan with nonstick spray. Dust with flour, tapping out any excess.", "Whisk toasted coconut, baking powder, salt, and 1 3/4 cups flour in a medium bowl. Mix coconut oil, vanilla, and 2/3 cup coconut milk in another medium bowl.", "Cream sugar and butter in the bowl of a stand mixer fitted with the paddle attachment at medium speed, occasionally scraping down sides of bowl, until pale and fluffy, 3–4 minutes. Add eggs, one at a time, beating to blend after each addition. Reduce mixer speed to low and beat in dry ingredients in 3 additions, alternating with coconut milk mixture in 2 additions, beginning and ending with dry ingredients. Pour batter into prepared pan, smoothing top with a spatula.", "Bake cake until top is set and golden brown and a tester inserted into the center comes out clean, 25–30 minutes.", "Mix key lime zest, juice, and remaining 2/3 cup coconut milk in a small bowl (it's okay if mixture separates slightly; it will be absorbed by cake). Using a skewer, poke holes every 2\" into warm cake. Slowly pour key lime zest mixture over cake. Transfer pan to a wire rack and let cake cool completely.", "Pour water into a medium pot to a depth of 2\". Bring to a simmer over medium heat. Place butter in a large bowl.", "Whisk egg yolks and sugar in a heatproof medium bowl. Whisk in key lime zest and juice. Set bowl on saucepan, making sure bottom does not touch water. Cook, whisking occasionally, until mixture is thick enough to coat the back of a spoon and an instant-read thermometer registers 175°F, 3–4 minutes.", "Strain egg yolk mixture through a fine-mesh sieve over butter, then stir with a rubber spatula until smooth. Place a piece of plastic wrap directly on key lime curd and chill at least 30 minutes.", "Using an electric mixer on medium speed, beat cream in a large bowl until stiff peaks form. Gently fold in chilled key lime curd and key lime zest. Spread cream on cooled cake with a spatula, then chill 30 minutes to set cream.", "Meanwhile, preheat oven to 350°F. Spread coconut flakes in a single layer on rimmed baking sheet and toast, tossing halfway through, until crispy and golden, 5–7 minutes. Let cool.", "When ready to serve, sprinkle toasted coconut flakes over cake.", "Lime curd can be made 1 week ahead. Store in an airtight container and chill, or freeze up to 4 months."], "fat": 35.0, "date": "2016-03-21T14:14:00.000Z", "categories": ["Cake", "Coconut", "Lime", "Lime Juice", "Easter", "Dessert", "Bake", "Birthday", "Kidney Friendly", "Vegetarian", "Pescatarian", "Peanut Free", "Tree Nut Free", "Soy Free", "Kosher"], "calories": 483.0, "desc": "This moist and fluffy dessert uses toasted coconut, coconut milk, and coconut oil to infuse as much flavor as possible into the cake. Good thing this sheet cake serves a crowd—the creamy key lime topping will have your guests coming back for a second piece.", "protein": 5.0, "rating": 4.375, "title": "Coconut-Key Lime Sheet Cake ", "ingredients": ["1 1/2 cups unsweetened shredded coconut", "Nonstick vegetable oil spray", "1 3/4 cups cake flour, plus more for pan", "1/2 teaspoon baking powder", "1/2 teaspoon kosher salt", "1/3 cup virgin coconut oil, melted", "1 1/2 teaspoons vanilla extract", "1 1/3 cups canned unsweetened coconut milk, divided", "1 1/2 cups sugar", "3/4 cup (1 1/2 sticks) unsalted butter, room temperature", "3 large eggs", "1 tablespoon finely grated key lime zest", "1/3 cup fresh key lime juice (from about 6 key limes)", "1/4 cup (1/2 stick) unsalted butter, cut into pieces, room temperature", "3 large egg yolks", "1/2 cup sugar", "1 teaspoon finely grated key lime zest", "1/4 cup fresh key lime juice (from about 4 key limes)", "1 1/2 cups cold heavy cream", "1 teaspoon finely grated key lime zest", "1 cup unsweetened coconut flakes"], "sodium": 100.0}, {"directions": ["Preheat oven to 425°F. Whisk 2 tablespoons oil and lemon juice in bowl; season dressing with salt and pepper. Place halibut on rimmed baking sheet; sprinkle with salt and pepper. Drizzle with some of dressing. Bake until just opaque in center, about 12 minutes.", "Meanwhile, cook pasta in large saucepan of boiling salted water until tender but still firm to bite; drain. Add 2 tablespoons oil and garlic to same saucepan; sauté over medium heat 1 minute. Add drained pasta, spinach, and tomatoes; stir to coat. Season with salt and pepper. Remove from heat. Cover; let stand 1 minute (spinach will wilt). Divide pasta between 2 plates. Top with halibut and remaining dressing."], "fat": 31.0, "date": "2005-10-01T04:00:00.000Z", "categories": ["Fish", "Leafy Green", "Pasta", "Tomato", "Bake", "Quick & Easy", "Halibut", "Spinach", "Healthy", "Bon Appétit", "California"], "calories": 634.0, "desc": "Kristi Parnell of San Marcos, California, writes: \"Whether I'm cooking for my family or for company, I like to keep my recipes healthy by using lots of fresh fish and vegetables. The baked halibut here has become a weeknight staple.\"", "protein": 44.0, "rating": 4.375, "title": "Baked Halibut with Orzo, Spinach, and Cherry Tomatoes ", "ingredients": ["4 tablespoons extra-virgin olive oil, divided", "2 tablespoons fresh lemon juice", "2 6- to 7-ounce halibut fillets", "1 cup orzo (rice-shaped pasta)", "1 garlic clove, minced", "4 cups (packed) baby spinach", "1 cup halved cherry tomatoes"], "sodium": 181.0}, {"directions": ["Fill 2 Old Fashioned glasses with ice. Divide rye, honey liqueur, and bitters between glasses. Stir for 5 seconds. Top with a splash of ginger ale. Garnish with orange twists."], "fat": null, "date": "2011-08-10T04:00:00.000Z", "categories": ["Bitters", "Liqueur", "Alcoholic", "Cocktail Party", "Father's Day", "Cocktail", "Rye", "Bon Appétit", "Drink"], "calories": null, "desc": "For inspiration, co-owner Eyal Raziel looked to his native Israel, where honey liqueur is popular. \"The Bärenjäger balances the kick of the rye,\" he says.", "protein": null, "rating": 0.0, "title": "Honey Rye ", "ingredients": ["5 tablespoons rye whiskey", "3 tablespoons honey liqueur (such as Bärenjäger)", "1/4 teaspoon orange bitters", "Ginger ale", "2 orange twists", "Ingredient info: Honey liqueur is available at well-stocked liquor stores and online from bevmo.com."], "sodium": null}, {"directions": ["Preheat oven to 450°F. Brush bottom and side of a 3-quart gratin dish (about 15 by 10 by 2 inches) with olive oil. With flat side of a heavy knife lightly crush garlic and rub over bottom and side of dish.", "In a small bowl stir together cream and nutmeg, sea salt, and white pepper to taste. Pick over crab meat to remove any bits of shell and cartilage and divide into 3 portions. Peel potatoes and with a mandoline or other manual slicer cut crosswise into 1/8-inch-thick slices. Divide potatoes into 4 portions. In gratin dish evenly arrange 1 portion potatoes and top with 1 portion crab, spreading evenly. Season crab layer with sea salt and white pepper. Repeat layering with remaining portions of potatoes and crab, seasoning each crab layer and ending with potatoes. Pour cream evenly over gratin and press down on top layer of potatoes to briefly submerge them in cream.", "Bake gratin, covered with foil, in middle of oven 20 minutes. Remove foil and bake gratin until potatoes are tender and lightly browned, about 25 minutes more."], "fat": null, "date": "2004-08-20T04:00:00.000Z", "categories": ["Milk/Cream", "Potato", "Side", "Bake", "Lunch", "Casserole/Gratin", "Crab", "Winter", "Gourmet", "Sugar Conscious", "Pescatarian", "Wheat/Gluten-Free", "Peanut Free", "Tree Nut Free", "Soy Free", "No Sugar Added"], "calories": null, "desc": "This recipe originally accompanied Poached Halibut with Black Truffles and Purple-Potato and Crab Gratin .", "protein": null, "rating": 3.75, "title": "Purple-Potato and Crab Gratin ", "ingredients": ["1 tablespoon olive oil", "1 garlic clove", "1 1/2 cups heavy cream", "freshly grated nutmeg", "sea salt", "freshly ground white pepper", "1 pound lump crab meat (preferably from Maine)", "3 pounds purple potatoes*", "*available at specialty produce markets"], "sodium": null}, {"directions": ["Heat a grill pan over medium-high heat. Season the steak with the salt and pepper and grill until medium-rare, 3 to 4 minutes per side. Let the meat rest for 5 minutes, then cut across the grain into 1/4-inch-thick slices.", "In a small bowl, combine the lime juice, vinegar, and sugar and whisk until the sugar is partially dissolved. Using the shredder attachment of a food processor, shred the jícama and apples; transfer to a bowl. Add the cilantro, lime zest, jalapeño, and dressing, and toss to combine.", "To serve, mound 1 1/2 cups of the salad into each serving bowl and top with about 7 slices of beef. Garnish each bowl with additional cilantro leaves and about 2 teaspoons of toasted peanuts. Serve immediately."], "fat": null, "date": "2013-07-31T04:00:00.000Z", "categories": ["Beef", "Vegetable", "Backyard BBQ", "Dinner", "Apple", "Steak", "Summer", "Healthy", "Dairy Free", "Wheat/Gluten-Free", "Tree Nut Free", "Soy Free", "Kosher"], "calories": null, "desc": "This Thai-inspired salad has that classic tart-sweet-spicy flavor balance that really gets your taste buds dancing. The cool, crunchy herb-laced salad is the yin to the yang of the rich tender beef. What\u0092s more, the food processor does most of the work.", "protein": null, "rating": 4.375, "title": "Grilled Beef, Jícama, and Apple Salad ", "ingredients": ["1 1/4 pounds shoulder center steak (ranch steak) or top sirloin steak, boneless", "1 teaspoon salt", "1/4 teaspoon freshly ground black pepper", "1/4 cup fresh lime juice", "1/4 cup rice vinegar", "2 tablespoons sugar", "1 large jícama (about 1 1/2 pounds), peeled", "2 green apples (about 1 pound), cored", "1/2 cup fresh cilantro leaves, plus more for garnish", "2 teaspoons finely grated lime zest", "1 medium jalapeño pepper, seeded and diced (about 2 teaspoons)", "3 tablespoons chopped roasted peanuts"], "sodium": null}, {"directions": ["Toss first 3 ingredients in large glass bowl. Add juice and vinegar; press down to submerge onions. Cut 1/2-inch-long slit in narrow tip of chile and add to onion mixture. Top mixture with small plate to weigh down slightly. Cover; refrigerate overnight. Drain. DO AHEAD Can be made 1 week ahead. Keep refrigerated."], "fat": 0.0, "date": "2007-04-24T21:31:48.000Z", "categories": ["Citrus", "Onion", "Pepper", "Freeze/Chill", "Chill", "Bon Appétit"], "calories": 90.0, "desc": "A habanero chile gives these onions a nice bit of heat.", "protein": 2.0, "rating": 4.375, "title": "Pickled Red Onions ", "ingredients": ["1 1/2 pounds red onions, peeled, halved, cut into 1/8-inch-thick slices", "1 1/2 teaspoons salt", "1/2 teaspoon dried oregano", "1 cup fresh lime juice", "1/2 cup distilled white vinegar", "1 small habanero chile*", "*Extremely hot chile; available in some supermarkets and at Latin markets."], "sodium": 881.0}, {"directions": ["In a kettle combine the beans, the ham hock, the garlic, the bay leaf, the orégano, the onion, the bell peppers, the red pepper flakes, the chili powder, and 8 cups water and simmer the mixture, covered, stirring occasionally, for 3 hours, or until the beans are tender. Stir in the tomatoes and salt to taste and simmer the mixture, uncovered, stirring occasionally, for 1 hour, or until the mixture is thickened. Discard the bay leaf, remove the ham hock from the mixture, and chop the meat. Stir the meat into the mixture with the coriander and the vinegar and serve the beans over the rice with the radish or onion.", "In a colander rinse the beans under cold water and discard any discolored ones. In a kettle combine the beans with enough cold water to cover them by 2 inches, bring the water to a boil, and boil the beans for 2 minutes. Remove the kettle from the heat and let the beans soak, covered, for 1 hour."], "fat": 8.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Bean", "Onion", "Rice", "Tomato", "Side", "Ham", "Bell Pepper", "Gourmet", "Dairy Free", "Wheat/Gluten-Free", "Peanut Free", "Tree Nut Free", "Soy Free", "No Sugar Added"], "calories": 202.0, "desc": null, "protein": 19.0, "rating": 3.75, "title": "Spicy Black Beans and Rice ", "ingredients": ["1 pound dried black beans, soaked in enough cold water to cover them by 2 inches overnight or quick-soaked (procedure follows) and drained", "1 ham hock", "2 large garlic cloves, minced", "1 bay leaf", "1 1/2 teaspoons dried orégano, crumbled", "3 cups coarsely chopped onion", "2 green bell peppers, chopped", "1/2 teaspoon dried hot red pepper flakes, or to taste", "1 tablespoon chili powder", "a 28-ounce can Italian tomatoes, drained and chopped", "1/3 cup finely chopped fresh coriander, or to taste", "red-wine vinegar to taste", "cooked rice as an accompaniment", "chopped radish or red onion as an accompaniment"], "sodium": 815.0}, {"directions": ["Mix first 6 ingredients in small bowl until almost smooth. Cover; chill. DO AHEAD: Can be made 1 day ahead. Keep chilled.", "Transfer goat cheese spread to shallow bowl. Drizzle oil over. Sprinkle mint leaves over and serve with crackers."], "fat": null, "date": "2008-11-04T04:00:00.000Z", "categories": ["Appetizer", "Christmas", "Cocktail Party", "Vegetarian", "Quick & Easy", "Oscars", "Dinner", "Goat Cheese", "Mint", "Christmas Eve", "Engagement Party", "Party", "Potluck", "Bon Appétit", "Sugar Conscious", "Kidney Friendly", "Pescatarian", "Wheat/Gluten-Free", "Peanut Free", "Tree Nut Free", "Soy Free", "No Sugar Added", "Kosher"], "calories": null, "desc": "This easy appetizer is packed with flavor. And since this is a Latin-themed party, don\u0092t forget to set out a bowl of chips with your favorite salsa.", "protein": null, "rating": 4.375, "title": "Herbed Goat Cheese Spread with Mint ", "ingredients": ["12 ounces soft fresh goat cheese, crumbled (about 21/2 cups), room temperature", "2 tablespoons whole milk", "2 teaspoons whole cumin seeds", "1 teaspoon dried dill weed", "1/2 teaspoon freshly ground black pepper", "2 garlic cloves, pressed", "1/4 cup extra-virgin olive oil", "20 mint leaves, thinly sliced", "32 (or more) seeded crackers"], "sodium": null}, {"directions": ["Heat oil in heavy large pot over medium heat. Add garlic and stir 20 seconds. Add chicken and oregano to pot; sprinkle with salt and pepper. Sauté 3 minutes. Add broth and lime juice and bring to simmer. Reduce heat to medium-low and simmer gently until chicken is cooked through, about 8 minutes. Season soup to taste with salt and pepper.", "Divide crushed tortilla chips among 6 bowls. Ladle soup into bowls. Top soup with avocados, tomatoes, green onions, cilantro and jalapeños. Garnish with lime slices and serve."], "fat": 21.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Soup/Stew", "Chicken", "Garlic", "Tomato", "Sauté", "Quick & Easy", "Lime", "Avocado", "Jalapeño", "Cilantro", "Simmer", "Bon Appétit"], "calories": 338.0, "desc": "A homey yet sophisticated soup that's great for casual entertaining.", "protein": 14.0, "rating": 4.375, "title": "Mexican Lime Soup ", "ingredients": ["2 tablespoons olive oil", "6 garlic cloves, sliced", "6 small skinless boneless chicken breast halves, cut crosswise into 1/2-inch-wide strips", "1 1/2 teaspoons dried oregano", "9 cups canned low-salt chicken broth", "1/3 cup fresh lime juice", "1 1/2 cups coarsely crushed tortilla chips", "2 avocados, peeled, pitted, diced", "3 tomatoes, chopped", "3 green onions, sliced", "Chopped fresh cilantro", "Minced jalapeño chilies", "Lime slices"], "sodium": 174.0}, {"directions": ["Cut peel and white pith from grapefruits and oranges. Cut between membranes to release segments. Combine fruit in large shallow bowl. (Fruit can be segmented 1 day ahead. Cover and refrigerate.)", "Place mint and sugar in processor. Using on/off turns, blend until mint is finely chopped, occasionally scraping down sides of bowl. Sprinkle mint sugar and pomegranate seeds over fruit; serve."], "fat": 1.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Salad", "Breakfast", "Brunch", "No-Cook", "Quick & Easy", "Grapefruit", "Orange", "Mint", "Winter", "Pomegranate", "Bon Appétit", "Vegan", "Vegetarian", "Pescatarian", "Dairy Free", "Wheat/Gluten-Free", "Peanut Free", "Tree Nut Free", "Soy Free", "Kosher"], "calories": 191.0, "desc": null, "protein": 3.0, "rating": 4.375, "title": "Citrus Salad with Mint Sugar ", "ingredients": ["2 white grapefruits", "2 pink grapefruits", "6 large navel oranges", "1/2 cup fresh mint leaves", "1/4 cup sugar", "Seeds from 1 pomegranate or 1/4 cup dried cranberries"], "sodium": 4.0}, {"directions": ["Heat a dry 12-inch heavy skillet over moderate heat until hot, 3 to 5 minutes. Lightly smash garlic in skins with side of a large knife, then add to skillet along with onion slice and cook, turning over once or twice with tongs, until onion is well browned and garlic is slightly softened, about 8 minutes.", "Meanwhile, discard stem, seeds, and veins from chile and tear chile into 4 pieces. Add chile to onion and garlic in skillet and toast, pressing flat with tongs and turning over occasionally, until chile turns a brighter red, about 1 minute.", "Discard garlic skins and coarsely chop onion, then purée garlic, onion, and chile in a blender with water, salt, and oregano until smooth.", "Heat oil in skillet over high heat until hot but not smoking, then sauté mushrooms, stirring occasionally, until golden and any liquid is evaporated, about 6 minutes. Reduce heat to moderate, then add tomato paste and cook, stirring, 1 minute. Add purée and cook, stirring, 3 minutes. Stir in broth and simmer 5 minutes."], "fat": 12.0, "date": "2006-05-16T20:12:06.000Z", "categories": ["Soup/Stew", "Blender", "Mushroom", "Quick & Easy", "Lunch", "Hot Pepper", "Fall", "Simmer", "Gourmet", "Sugar Conscious", "Dairy Free", "Wheat/Gluten-Free", "Peanut Free", "Tree Nut Free", "Soy Free", "No Sugar Added", "Kosher"], "calories": 166.0, "desc": null, "protein": 8.0, "rating": 3.125, "title": "Mexican Chile and Mushroom Soup ", "ingredients": ["3 large garlic cloves, left unpeeled", "1 (1/2-inch-thick) slice large white onion", "1 (3-inch-long) small dried ancho chile* (1/4 ounce)", "1/2 cup water", "3/4 teaspoon salt", "1/2 teaspoon dried oregano (preferably Mexican), crumbled", "2 tablespoons vegetable oil", "10 ounces mushrooms, trimmed and thinly sliced", "1 tablespoon tomato paste", "3 1/2 cups low-sodium chicken broth (28 fluid ounces)", "*Available at Latino markets, some specialty foods shops, some supermarkets, and Chile Today–Hot Tamale (800-468-7377)."], "sodium": 508.0}, {"directions": ["Preheat oven to 400°F. Line 12 muffin cups with muffin papers. Stir first 4 ingredients in small bowl to blend. Using electric mixer, beat bananas, honey, peanut butter, eggs, oil, sugar and vanilla in medium bowl to blend. Beat in flour mixture. Divide batter among muffin cups.", "Bake muffins until tester inserted into center comes out clean, about 20 minutes. Transfer muffins to rack; cool."], "fat": 13.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Bread", "Mixer", "Breakfast", "Brunch", "Bake", "Kid-Friendly", "Back to School", "Banana", "Bon Appétit"], "calories": 275.0, "desc": null, "protein": 6.0, "rating": 3.75, "title": "Peanut Butter-Banana Muffins ", "ingredients": ["1 3/4 cups all purpose flour", "1/4 cup toasted wheat germ", "1 teaspoon baking soda", "1/2 teaspoon salt", "1 cup mashed ripe bananas (about 3 medium)", "1/2 cup honey", "1/2 cup chunky peanut butter", "2 large eggs", "1/3 cup vegetable oil", "1/4 cup (packed) dark brown sugar", "1 teaspoon vanilla extract"], "sodium": 242.0}, {"directions": ["Pat the chicken dry and season salt and pepper. Heat the olive oil in a Dutch oven or heavy soup pot over medium-high heat. Add the chicken, working in batches if necessary, and cook until well browned on each side, about 3 minutes per side. Transfer to a plate.", "Decrease the heat to medium. Add the onion and a pinch of salt and sauté until soft and slightly golden, about 5 minutes. Add the garlic and sauté for 1 minute. Add the turmeric, cumin, coriander, red pepper flakes, cinnamon stick, and bay leaf and cook, stirring constantly, until fragrant, about 1 minute. Pour in 1/4 cup of the broth to deglaze the pot, stirring to loosen any bits stuck to the pot. Stir in a pinch of salt and cook until the liquid is reduced by half. Stir in the remaining 1 3/4 cups of broth, the lemon zest, and 2 tablespoons of the lemon juice. Decrease the heat to medium-low, cover, and simmer for 15 minutes.", "Add the chicken, chickpeas, artichoke hearts, and olives and stir gently to combine. Increase the heat to medium-high and simmer uncovered, stirring occasionally, until the chicken is heated through, about 5 minutes. Stir in the remaining tablespoon of lemon juice. Taste; you may want to add another squeeze of lemon juice or pinch of salt. Garnish with the mint."], "fat": null, "date": "2013-02-20T04:00:00.000Z", "categories": ["Chicken", "Olive", "Vegetable", "Braise", "Dinner", "Spice", "Artichoke", "Healthy", "One-Pot Meal", "Dairy Free", "Wheat/Gluten-Free", "Peanut Free", "Tree Nut Free", "Soy Free", "No Sugar Added", "Kosher"], "calories": null, "desc": "I didn't think it was possible to love artichokes more than I already did until I lived in Italy. There they harvest artichokes in both spring and fall, and that abundance graces their cuisine. Artichokes also enhance their health, as they stimulate the gallbladder to produce bile, which escorts toxins out of the body and also helps break down fats in the diet. Here, artichoke hearts are combined with chicken, chickpeas, and olives to create a rich, nourishing stew, seasoned with a potpourri of heady and healthful spices, including turmeric, cumin, coriander, and mint. For a wonderful pairing, serve it over Brown Rice Pilaf with Saffron and Ginger .", "protein": null, "rating": 4.375, "title": "Braised Chicken With Artichokes and Olives ", "ingredients": ["8 organic boneless, skinless chicken thighs (about 11/2 pounds), trimmed of excess fat", "Sea salt", "Freshly ground black pepper", "3 tablespoons extra-virgin olive oil", "1 yellow onion, diced", "3 cloves garlic, thinly sliced", "1 teaspoon turmeric", "1/2 teaspoon ground cumin", "1/2 teaspoon ground coriander", "Generous pinch red pepper flakes", "1 cinnamon stick, or 1/4 teaspoon ground cinnamon", "1 bay leaf", "2 cups organic chicken broth, homemade or\nstore-bought", "2 teaspoons grated lemon zest", "3 tablespoons freshly squeezed lemon juice", "1 cup canned chickpeas, drained, rinsed, and mixed with a spritz of lemon juice and a pinch of salt", "8 thawed frozen or jarred artichoke hearts (see note), quartered", "1/2 cup pitted green olives, such as picholine or manzanilla", "2 tablespoons chopped fresh mint or cilantro"], "sodium": null}, {"directions": ["Preheat oven to 400°F. Melt 1/4 cup butter in large skillet over medium heat. Add giblets (if using), onion, carrot, sage, and garlic. Sauté until carrot is tender, about 10 minutes. Add wine; simmer until evaporated, scraping up browned bits. Remove from heat. Mix in bread, walnuts, egg, Parmesan, 1/2 teaspoon salt, and 1/2 teaspoon pepper.", "Spoon stuffing into cavities of chickens; skewer cavities closed. Rub each chicken with 2 tablespoons butter; sprinkle with salt and pepper. Arrange in roasting pan. Lay 6 pancetta slices atop each to cover. Surround with fennel.", "Roast chickens and fennel 45 minutes. Turn fennel over. Roast until chickens are golden and thermometer inserted into thickest part of thigh registers 165°F, basting with pan juices, about 30 minutes. Transfer chickens and fennel to platter. Let rest 10 minutes.", "Tilt roasting pan; spoon fat from pan juices. Serve chickens with pan juices.", "Pancetta (Italian bacon) is sold in the deli case of many supermarkets and at Italian markets."], "fat": 87.0, "date": "2008-04-02T18:27:00.000Z", "categories": ["Chicken", "Roast", "High Fiber", "Dinner", "Bacon", "Fall", "Spring", "Summer", "Winter", "Family Reunion", "Bon Appétit", "Peanut Free", "Soy Free"], "calories": 1203.0, "desc": "Topping the chicken with pancetta slices before roasting adds a rich flavor.", "protein": 89.0, "rating": 5.0, "title": "Pancetta Roast Chicken with Walnut Stuffing ", "ingredients": ["8 tablespoons (1 stick) butter, divided", "Chopped hearts, livers, and gizzards reserved from chickens (optional)", "1 cup chopped onion", "3/4 cup small cubes peeled carrot", "2 large fresh sage leaves, minced", "1 large garlic clove, halved", "1/4 cup dry white wine", "1 cup small cubes crustless country bread", "1/2 cup coarsely chopped walnuts", "1 large egg, beaten to blend", "1 tablespoon grated Parmesan cheese", "1/2 teaspoon salt", "1/2 teaspoon freshly ground black pepper", "2 4-pound chickens, rinsed, patted dry", "12 thin pancetta slices", "3 large fresh fennel bulbs, trimmed, each cut into 6 wedges"], "sodium": 583.0}, {"directions": ["Onto a sheet of wax paper sift the flour 3 times. In a large bowl with an electric mixer beat the egg whites with the salt until they are frothy, add the cream of tartar, and beat the whites until they hold soft peaks. Beat in 1/2 cup of the sugar, a little at a time, add the vanilla and the almond extract, and beat the whites until they hold stiff peaks. Fold in the remaining 1/2 cup sugar, a little at a time, sift the flour over the whites in 4 batches, folding it in gently after each addition, and fold in the coconut. Spoon the batter into a tube pan, 9 inches across the top and 3 1/2 inches deep, and bake the cake in the middle of a preheated 275°F. oven for 1 1/2 hours. Hang the cake in the pan upside down on the neck of a bottle and let it cool for 1 1/2 to 2 hours, or until it is cooled completely. Release the cake from the side of the pan and from the center tube with a sharp knife, turn it out onto a rack, and invert it onto a cake plate.", "In a metal bowl whisk together the sugar, the egg whites, the zest, the orange juice, the corn syrup, and pinch of salt, set the bowl over a saucepan of simmering water, and cook the mixture, whisking until it registers 140°F. on a candy thermometer. Remove the pan from the heat and whisk the mixture over the hot water for 3 minutes. Remove the bowl from the pan and with an electric mixer beat the frosting at high speed for 7 to 10 minutes, or until it is cool and hold stiff peaks.", "Spread the top and sides (including the center) of the cake with the frosting and coat the outside with the toasted coconut."], "fat": 7.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Cake", "Egg", "Dessert", "Bake", "Coconut", "Birthday", "Shower", "Party", "Gourmet"], "calories": 266.0, "desc": null, "protein": 4.0, "rating": 3.75, "title": "1977 Coconut Angel Food Cake ", "ingredients": ["3/4 cup cake flour (not self-rising)", "8 large egg whites", "1/2 teaspoon salt", "1/2 teaspoon cream of tartar", "1 cup superfine sugar", "1/2 teaspoon vanilla", "1/2 teaspoon almond extract", "1/2 cup shredded unsweetened coconut (available at natural foods stores)", "1 1/4 cups sugar", "2 large egg whites", "1 teaspoon freshly grated orange zest", "1/4 cup strained fresh orange juice", "1 tablespoon light corn syrup", "1 cup shredded unsweetened coconut (available at natural foods stores), toasted"], "sodium": 148.0}, {"directions": ["Preheat the oven to 400°F. Set out all four chicken cutlets on a cutting board and sprinkle with the paprika, onion powder, and black pepper. Place a slice of the prosciutto on top of each chicken cutlet, then a collard leaf. Roll the stacks up, chicken on the outside, and secure with a toothpick.", "Coat a large, oven-safe skillet with 1 tablespoon of the olive oil. Place over high heat and add the chicken roulades. Brown for 3–4 minutes, turning often. Transfer the skillet with the chicken to the oven and bake for 10–15 minutes until the chicken is cooked through. Transfer to a clean cutting board and let rest for 5 minutes.", "Place the watercress in a large bowl along with the remaining 3 tablespoons oil and the vinegar and toss well to coat. Divide the watercress equally among four plates. Top with the figs. Slice the chicken and arrange over the watercress. Serve immediately."], "fat": null, "date": "2016-07-06T13:00:00.000Z", "categories": ["HarperCollins", "Dinner", "Chicken", "Prosciutto", "Quick and Healthy", "Collard Greens", "Fig", "Watercress", "Wheat/Gluten-Free", "Paleo", "Dairy Free", "Peanut Free", "Tree Nut Free", "Soy Free", "No Sugar Added"], "calories": null, "desc": "This is a simple recipe that tends to impress. These elegant roulades are surprisingly easy to make and will get you a standing ovation at the dinner table. Take a bow, as you're giving everyone a nice dose of brain protection thanks to the vitamin A, vitamin C, vitamin K, fiber, and phytonutrients found in the watercress and collards. If you can\u0092't locate fresh figs, swap in two thinly sliced ripe pears, and feel free to swap out the collards for kale.", "protein": null, "rating": 5.0, "title": "Collard-and-Prosciutto Chicken Roulades Over Watercress Salad ", "ingredients": ["4 thinly sliced raw chicken cutlets (about 1 pound)", "1/2 teaspoon paprika", "1/2 teaspoon onion powder", "1/4 teaspoon freshly ground black pepper", "4 slices prosciutto", "4 large collard leaves, trimmed", "4 tablespoons olive oil", "1 pound watercress", "2 tablespoons balsamic vinegar", "1 pint fresh figs, quartered"], "sodium": null}, {"directions": ["Mix cheese and green onions in medium bowl. Gently mix ground veal, Worcestershire sauce, salt and pepper in large bowl. Divide veal mixture into 4 equal portions. Divide 1 portion in half; form two 1/8-inch-thick patties. Place 1/4 cup cheese mixture atop 1 patty; top with second patty. Seal at edges to enclose cheese mixture. Repeat with remaining 3 portions.", "Mix mayonnaise, mustard, lemon peel and sage in small bowl. (Patties and mayonnaise mixture can be made 2 hours ahead. Cover separately and refrigerate.) Preheat oven to 400°F. Place mushrooms on rimmed baking sheet. Combine 4 tablespoons oil and garlic. Brush over both sides of mushrooms. Sprinkle with salt and pepper. Roast mushrooms until tender, turning once, about 20 minutes.", "Heat remaining 2 tablespoons oil in heavy large skillet over medium-high heat. Add burgers and cook until cheese melts, about 5 minutes per side.", "Spread mayonnaise mixture over buns. Place burgers on bottom halves. Top with mushrooms, then with bun tops."], "fat": 70.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Sandwich", "Beef", "Cheese", "Mushroom", "Mustard", "Quick & Easy", "Mozzarella", "Ground Beef", "Veal", "Fall", "Winter", "Bon Appétit"], "calories": 904.0, "desc": null, "protein": 38.0, "rating": 4.375, "title": "Veal Burgers Stuffed with Mozzarella Cheese ", "ingredients": ["1 cup shredded mozzarella cheese", "1/4 cup finely chopped green onions", "1 1/4 pounds ground veal", "2 teaspoons Worcestershire sauce", "1 teaspoon salt", "teaspoon ground black pepper", "1/2 cup mayonnaise", "2 teaspoons coarse-grained mustard", "1 teaspoon grated lemon peel", "1/2 teaspoon dried rubbed sage", "4 4-inch-diameter portobello mushrooms, stemmed", "6 tablespoons olive oil", "2 garlic cloves, minced", "4 large sesame-seed buns, split, toasted"], "sodium": 1413.0}, {"directions": ["Preheat oven to 400°F with rack in middle. Butter muffin pan if not nonstick.", "Soak raisins in hot water 5 minutes, then drain.", "Meanwhile, whisk together flour, baking powder, baking soda, spices, and salt in a large bowl.", "In a separate bowl, whisk together butter, brown sugar, pumpkin, buttermilk, eggs, and vanilla. Add to dry ingredients and stir until just combined, then stir in raisins and 2 tablespoons pumpkin seeds.", "Divide batter among muffin cups and sprinkle with remaining seeds. Bake until a wooden pick comes out clean, about 20 minutes. Cool slightly on a rack."], "fat": 10.0, "date": "2008-10-16T04:00:00.000Z", "categories": ["Breakfast", "Brunch", "Bake", "Thanksgiving", "Kid-Friendly", "Quick & Easy", "Pumpkin", "Fall", "Seed", "Gourmet", "Kidney Friendly", "Vegetarian", "Pescatarian", "Peanut Free", "Tree Nut Free", "Soy Free", "Kosher"], "calories": 223.0, "desc": "Just right for breakfast on the go, these muffins are subtly spiced, fluffy, and speckled with plenty of golden raisins.", "protein": 4.0, "rating": 4.375, "title": "Pumpkin Muffins ", "ingredients": ["1/3 cup golden raisins", "2 cups all-purpose flour", "2 teaspoon baking powder", "1/4 teaspoon baking soda", "1 teaspoon ground cinnamon", "3/4 teaspoon ground ginger", "1/8 teaspoon ground allspice", "1/8 teaspoon ground cloves", "1/2 teaspoon salt", "1 stick unsalted butter, melted and cooled", "3/4 cup packed light brown sugar", "3/4 cup canned pure pumpkin", "1/4 cup well-shaken buttermilk", "2 large eggs", "1 teaspoon pure vanilla extract", "3 tablespoon raw green (hulled) pumpkin seeds (pepitas), divided", "Equipment: a muffin pan (preferably nonstick) with 12 (1/2-cup) muffin cups"], "sodium": 211.0}, {"directions": ["Heat butter in a 3-quart heavy saucepan over moderate heat until foam subsides, then cook shallot, stirring, until golden brown, about 5 minutes. Stir in remaining ingredients and simmer briskly, uncovered, stirring occasionally, until thickened and reduced to about 2 1/4 cups, about 25 minutes."], "fat": 3.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Condiment/Spread", "Fruit Juice", "Citrus", "Christmas", "Quick & Easy", "Orange", "Winter", "Simmer", "Gourmet"], "calories": 194.0, "desc": "This recipe is an accompaniment for Buffalo Prime Rib with Orange Balsamic Glaze.", "protein": 2.0, "rating": 3.75, "title": "Orange Balsamic Glaze ", "ingredients": ["1 1/2 tablespoons unsalted butter", "1 cup finely chopped shallot", "1 cup thawed frozen orange juice concentrate (8 oz)", "1/2 cup water", "1/2 cup sweet orange preserves", "1/2 cup balsamic vinegar", "1 tablespoon salt", "1/2 tablespoon cracked black peppercorns", "1 1/2 teaspoons finely grated fresh orange zest"], "sodium": 697.0}, {"directions": ["Preheat oven to 475°F. Pierce eggplants with fork. Place on baking sheet. Roast until skins are blackened and eggplants are soft, turning occasionally, about 1 hour. Cut eggplants in half. Spoon flesh into strainer set over bowl; drain 15 minutes. Maintain oven temperature.", "Meanwhile, brush pita rounds lightly with oil. Sprinkle pita rounds with salt and pepper. Cut each pita round into 6 wedges. Arrange wedges on clean baking sheet. Bake until crisp, about 4 minutes; cool.", "Transfer drained eggplant to medium bowl. Mix in olives, garlic, vinegar, cumin and 1 tablespoon oil. Season spread with salt and pepper. Mound in small bowl. Serve with chips."], "fat": 7.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Condiment/Spread", "Olive", "Vegetable", "Roast", "Cocktail Party", "Vegetarian", "Eggplant", "Vegan", "Bon Appétit", "Santa Monica", "California"], "calories": 177.0, "desc": null, "protein": 5.0, "rating": 3.75, "title": "Roasted Eggplant and Olive Spread with Pita Bread Chips ", "ingredients": ["3 1-pound eggplants", "3 6- to 7-inch-diameter pita breads, cut horizontally in half", "Olive oil", "1/4 cup chopped pitted Kalamata olives or other brine-cured black olives", "3 large garlic cloves, minced", "1 tablespoon red wine vinegar", "2 teaspoons ground cumin"], "sodium": 116.0}, {"directions": ["In a preheated 350°F oven toast 1/2 cup pecans, about 7 minutes, and cool. Finely chop toasted pecans and separate egg. In a bowl with a fork cream butter and Saga until smooth. Add egg yolk, stirring until combined well. Add flour and chopped pecans and stir until mixture just forms a dough.", "Halve dough and on separate sheets of wax paper form each half into a 12- by 1 1/4-inch log, using wax paper as a guide. Freeze logs, wrapped in wax paper, just until firm, about 30 minutes.", "Preheat oven to 375°F. and lightly grease 2 large baking sheets.", "Cut logs crosswise into 1/4-inch-thick slices and arrange slices about 1/2 inch apart on baking sheets. Top each cracker with a remaining pecan half, pressing slightly into dough. Brush tops of crackers, including pecans, with lightly beaten egg white. Bake crackers in batches, if necessary, in upper and lower thirds of oven, switching position of sheets halfway through baking, until golden brown, about 12 minutes total. With a spatula transfer crackers to paper towels to blot and transfer to a rack to cool."], "fat": 6.0, "date": "2004-08-20T12:48:48.000Z", "categories": ["Cheese", "Dairy", "Nut", "Bake", "Super Bowl", "Winter", "Gourmet"], "calories": 70.0, "desc": null, "protein": 2.0, "rating": 3.75, "title": "Pecan Blue Cheese Crackers ", "ingredients": ["1 1/2 cups pecan halves", "1 large egg", "1 stick (1/2 cup) unsalted butter, softened", "1/2 pound Saga blue cheese, softened", "1 cup all-purpose flour"], "sodium": 60.0}, {"directions": ["Prepare grill for direct-heat cooking over hot charcoal (high heat for gas); see Grilling Procedure .", "Put parmesan in a medium bowl and add olive oil in a slow stream, whisking. Whisk in lime juice, garlic, chipotles, and 1/4 teaspoon each of salt and pepper.", "Rub vegetable oil on corn and cut sides of avocados, then season with 1/8 teaspoon each of salt and pepper. Grill avocados, cut sides down, and corn, covered only if using a gas grill, turning corn occasionally, until golden-brown, 3 to 4 minutes.", "Peel avocados and thinly slice. Cut corn kernels from cobs.", "Toss romaine with dressing and serve topped with avocado and corn."], "fat": 32.0, "date": "2009-05-21T04:00:00.000Z", "categories": ["Salad", "Side", "Fourth of July", "Quick & Easy", "Backyard BBQ", "Lunch", "Parmesan", "Avocado", "Corn", "Grill", "Grill/Barbecue", "Lettuce", "Chile Pepper", "Gourmet", "Vegetarian", "Pescatarian", "Wheat/Gluten-Free", "Peanut Free", "Tree Nut Free", "Soy Free", "No Sugar Added", "Kosher"], "calories": 368.0, "desc": "Grilled avocado is one of those things that sound faintly ridiculous until you try it—then you wonder why you never had it before.", "protein": 6.0, "rating": 4.375, "title": "Romaine, Grilled Avocado, and Smoky Corn Salad with Chipotle-Caesar Dressing ", "ingredients": ["1/4 cup grated parmesan", "1/2 cup extra-virgin olive oil", "1/4 cup fresh lime juice", "1 teaspoon minced garlic", "1 tablespoon minced canned chipotle chiles in adobo", "3 tablespoons vegetable oil", "2 ears of corn, shucked", "2 firm-ripe 6-to 8-ounces avocados, halved and pitted but not peeled", "1 head romaine (1 pound), tough outer leaves discarded and head quartered lengthwise, then cut crosswise into 1-inch strips"], "sodium": 112.0}, {"directions": ["Melt butter in heavy large skillet over medium-high heat. Add all chilies; sauté until beginning to soften, about 8 minutes. Stir in 1 package corn and green onions. Transfer to very large bowl. Mix in cilantro. Coarsely crumble corn bread into vegetable mixture; toss to blend.", "Blend second package of corn, eggs, sugar, salt, and pepper in processor to coarse puree. Stir mixture into stuffing.", "Loosely fill neck and main cavities of turkey with stuffing. Add enough broth to remaining stuffing to moisten slightly (1/4 to 3/4 cup, depending on amount of remaining stuffing). Generously butter baking dish. Spoon remaining stuffing into prepared dish. Cover with buttered foil, buttered side down. Bake stuffing in dish along side turkey until heated through, about 25 minutes. Uncover stuffing. Bake until top of stuffing is slightly crisp and golden, about 15 minutes longer.", "Preheat oven to 350°F. Generously butter 13x9x2-inch glass baking dish, depending on recipe. Transfer stuffing to prepared dish. Cover with buttered foil, buttered side down. Bake until heated through, about 40 minutes. Uncover and bake until top is slightly crisp and golden, about 20 minutes longer.", "Available at Latin American markets and many supermarkets."], "fat": 15.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Side", "Bake", "Thanksgiving", "Corn", "Hot Pepper", "Fall", "Jalapeño", "Bon Appétit", "Vegetarian", "Pescatarian", "Wheat/Gluten-Free", "Peanut Free", "Tree Nut Free", "Soy Free", "Kosher"], "calories": 293.0, "desc": "For best results, make this stuffing with day-old Buttermilk Corn Bread.", "protein": 7.0, "rating": 5.0, "title": "Southwest Corn Bread Stuffing with Corn and Green Chilies ", "ingredients": ["10 tablespoons unsalted butter", "1 1/4 cups chopped seeded fresh Anaheim chilies* (8 ounces)", "1 1/4 cups chopped seeded fresh poblano chilies * (8 ounces)", "3 large jalapeño chilies, seeded, chopped", "2 1-pound packages frozen petite yellow corn kernels, thawed", "1 1/4 cups chopped green onions", "2/3 cup chopped fresh cilantro", "Buttermilk Corn Bread , 1 day old", "4 large eggs", "1/4 cup sugar", "2 1/4 teaspoons salt", "1/2 teaspoon ground black pepper"], "sodium": 565.0}, {"directions": ["Preheat the oven to 350ºF. Grease a 10-inch round cake pan.", "Place the lard and brown sugar in the bowl of a stand mixer fitted with the paddle attachment. Mix on low speed to combine, and then increase the speed to high to cream them together. Mix until the mixture becomes smooth and a very light brown, scraping down the sides of the bowl as needed; this takes about 20 minutes.", "Meanwhile, whisk together the flour, cornmeal, baking powder, baking soda, salt, ginger, cinnamon, nutmeg, and cloves in a large bowl. In a separate large bowl, whisk together the apple butter, buttermilk, and bourbon.", "Once the lard-sugar mixture is ready, reduce the speed to medium and add the eggs and egg yolk, one at a time, until incorporated. Add the flour mixture in thirds, alternating with the apple butter mixture, mixing only until the batter is smooth each time.", "Pour the batter into the prepared cake pan and bake for 40 to 45 minutes, until a toothpick inserted in the center comes out dry. Turn out of pan onto a rack to cool while you make the syrup.", "Combine the sorghum and cream in a heavy-bottomed saucepan, and bring to a boil. Then reduce the heat to low and simmer for 10 minutes. Whisk until well blended.", "Transfer the cake to a serving plate. Poke holes throughout the top of the cake with a fork, and slowly pour the syrup all over the cake until it has been absorbed. Serve slightly warm."], "fat": 19.0, "date": "2016-08-31T21:13:22.157Z", "categories": ["Cake", "Molasses", "Buttermilk", "Bake", "Cornmeal", "Spice", "Ginger", "Cinnamon", "Clove", "Nutmeg"], "calories": 523.0, "desc": "Eastern Kentucky–born and –raised chef Colin Perry plies his art now in Montreal at Dinette Triple Crown. The food there taps into traditions of both the far north and the high country South, as in this delectably oh-so-sticky pudding. “I tend to use a lot of maple syrup in my cooking up here, because it’s so delicious and so accessible. But sometimes the taste of sorghum is the only taste that will do,” he says. Really fresh leaf lard has become more available in recent years from artisan butchers and specialty stores. If you can’t get real lard, then use butter. Shortening and grocery-store lard aren’t worth it.", "protein": 8.0, "rating": 0.0, "title": "Colin Perry’s Sorghum and Apple Sticky Pudding ", "ingredients": ["1/4 pound leaf lard, cut into large cubes, at room temperature, plus a little to grease the pan", "1 cup packed light brown sugar", "3/4 cup plus 2 tablespoons all-purpose flour", "3/4 cup plus 1 tablespoon stone-ground white cornmeal", "1 teaspoon baking powder", "1 teaspoon baking soda", "1 teaspoon salt", "1 1/2 tablespoons ground ginger", "1 1/2 teaspoons ground cinnamon", "1/2 teaspoon freshly grated nutmeg", "1/8 teaspoon ground cloves", "1 cup apple butter", "1 cup whole buttermilk", "2 tablespoons bourbon", "2 large eggs", "1 large egg yolk", "1 cup sorghum syrup", "1/2 cup heavy cream"], "sodium": 694.0}, {"directions": ["Preheat oven to 250°F and line 2 large baking sheets with parchment.", "Swirl whites in a metal bowl set over a saucepan of simmering water until barely warm to the touch. Beat whites with salt in a standing electric mixer until they hold soft peaks. Beat in 2 cups superfine sugar and continue beating until mixture holds stiff, glossy peaks (see cooks' note, below). Stir together remaining 1/2 cup superfine sugar and cornstarch. Beat into meringue, then beat in vinegar.", "Spoon 8 mounds of meringue (each about 2 inches high and approximately 1/2 cup) 1 inch apart on each lined baking sheet. Divide any remaining meringue among mounds. Bake in upper and lower thirds of oven, switching position of sheets halfway through baking, until crisp but still soft inside, 1 to 1 1/4 hours total. If meringues are still not crisp after 1 1/4 hours, turn off oven and cool in oven 1 hour. Transfer from parchment to racks to cool. (Meringues may stick if cooled completely on paper.)", "Just before serving, toss strawberries with lime juice and 1/4 cup granulated sugar and let stand, tossing occasionally until sugar is dissolved, 10 minutes. Add blackberries and toss to coat.", "Beat cream with vanilla and remaining 1 1/2 tablespoons granulated sugar with cleaned beaters. Tap meringues gently with back of a spoon to create indentations, then mound some whipped cream and berries onto each."], "fat": 7.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Milk/Cream", "Mixer", "Egg", "Dessert", "Bake", "Blackberry", "Strawberry", "Summer", "Engagement Party", "Party", "Gourmet", "Kidney Friendly", "Vegetarian", "Pescatarian", "Wheat/Gluten-Free", "Peanut Free", "Tree Nut Free", "Soy Free", "Kosher"], "calories": 252.0, "desc": null, "protein": 4.0, "rating": 3.75, "title": "Mixed Berry Pavlovas ", "ingredients": ["13 large egg whites", "1/4 teaspoon salt", "2 1/2 cups superfine granulated sugar", "1 1/2 tablespoons cornstarch", "1 1/2 tablespoons distilled white vinegar", "2 lb strawberries, halved or quartered if large", "3 tablespoons fresh lime juice", "1/4 cup plus 1 1/2 tablespoons granulated sugar", "1 lb blackberries", "2 1/2 cups chilled heavy cream", "2 teaspoons vanilla", "Special equipment: a standing electric mixer"], "sodium": 89.0}, {"directions": ["Preheat oven to 350°F. Butter three 9-inch-diameter cake pans with 1 1/2-inch-high sides. Dust with flour; tap out excess. Using vegetable peeler, remove peel (orange part only) in strips from oranges. Coarsely chop enough peel to measure 1/2 cup. Combine flour, 1 cup almonds, baking powder and salt in processor; blend until finely ground. Transfer to medium bowl. Place 2 cups sugar and orange peel in processor; blend until peel is finely minced.", "Using electric mixer, beat butter in large bowl until blended. Add sugar mixture and beat until fluffy. Beat in eggs 1 at a time. Mix milk and both extracts in small bowl. On low speed, beat flour mixture into egg mixture alternately with milk mixture in 3 additions each. Divide batter among prepared pans.", "Bake cakes until tester inserted into center comes out clean, about 25 minutes. Cool cakes in pans on racks 5 minutes. Turn cakes out onto racks and cool completely. Boil 1 1/2 cups fresh orange juice and remaining generous 1 tablespoon sugar in small saucepan until reduced to 1/2 cup, about 8 minutes. Brush warm juice mixture over tops of cooled cakes.", "Place 1 cake layer, orange syrup side up, on cake platter. Spread 1 cup Chocolate Icing over. Top with second cake layer, then 1 cup icing. Top with third cake layer, syrup side up. Spread remaining icing over top and sides of cake. (Can be prepared 1 day ahead. Cover with cake dome and store at room temperature.) Arrange additional almonds, orange triangles and mint leaves around top edge of cake. Slice cake and serve."], "fat": null, "date": "2004-08-20T04:00:00.000Z", "categories": ["Cake", "Food Processor", "Mixer", "Chocolate", "Dessert", "Bake", "Orange", "Almond", "Birthday", "Bon Appétit", "Vegetarian", "Pescatarian", "Peanut Free", "Soy Free", "Kosher"], "calories": null, "desc": "An impressive-looking layer cake with great flavor—and lots of room for candles.", "protein": null, "rating": 4.375, "title": "Orange-Almond Cake with Chocolate Icing ", "ingredients": ["3 large oranges", "2 cups plus 2 tablespoons all purpose flour", "1 cup whole almonds", "2 teaspoons baking powder", "1/2 teaspoon salt", "2 cups plus generous 1 tablespoon sugar", "1 cup unsalted butter, room temperature", "4 large eggs", "1 cup whole milk", "1/2 teaspoon vanilla extract", "1/4 teaspoon almond extract", "1 1/2 cups fresh orange juice", "Chocolate Icing", "Additional whole almonds", "Small orange-slice triangles", "Fresh mint leaves"], "sodium": null}, {"directions": ["Grind the parsley, sage, rosemary, and thyme into a fine powder. I use a coffee grinder for this.", "In a mixing bowl, crumble the tofu and mix well with the spice mixture so that the herbs are well infused with the tofu. Let sit for the flavors to meld.", "In a microwave-safe bowl, mix together the TVP granules and the broth, cover tightly with plastic wrap, and microwave for 5 to 6 minutes. Alternatively, bring the broth to a boil, pour over the TVP, cover, and let sit for 10 minutes.", "When cool enough to handle, add the TVP to the tofu mixture, then add the minced garlic, flaxseed mixture, sunflower seeds, pumpkin seeds, and salt and pepper to taste. Mix with your hands until all the ingredients are very well incorporated. The mixture will be nice and smooth, and should form lovely burgers. Shape into 6 patties. Refrigerate until ready to cook, although refrigeration isn't necessary if you plan on cooking them right away.", "I recommend baking these rather than frying. It just seems that this burger is too healthy to fry. Preheat the oven to 350°F (180°C, or gas mark 4) and line a baking sheet with parchment or a silicone baking mat. Bake, covered with a foil tent, for 15 minutes per side."], "fat": 12.0, "date": "2011-06-23T04:00:00.000Z", "categories": ["Microwave", "Bake", "Vegetarian", "Wheat/Gluten-Free", "Dinner", "Lunch", "Rosemary", "Tofu", "Fall", "Winter", "Vegan", "Sage", "Thyme", "Parsley", "Coffee Grinder", "Sugar Conscious", "Pescatarian", "Peanut Free", "Tree Nut Free", "No Sugar Added", "Kosher"], "calories": 224.0, "desc": "Wheat Free", "protein": 21.0, "rating": 3.125, "title": "Scarborough Fair Tofu Burger ", "ingredients": ["1 tablespoon (2 g) dried parsley", "1 tablespoon (2 g) dried sage", "1 tablespoon (2 g) dried rosemary", "1 tablespoon (2 g) dried thyme", "12 ounces (340 g) extra-firm tofu, drained and pressed", "1 cup (96 g) TVP granules", "1 cup (235 ml) vegetable broth", "2 tablespoons (30 g) minced garlic", "2 1/2 tablespoons (19 g) ground flaxseed mixed with", "3 tablespoons (45 ml) water", "1/4 cup (32 g) hulled sunflower seeds", "1/4 cup (32 g) hulled pumpkin seeds", "Salt and pepper"], "sodium": 340.0}, {"directions": ["Combine the vinegar, garlic, mustard, and oregano in a small bowl. Add the olive oil in a slow, steady stream while whisking constantly until all the oil is incorporated. Season with salt and pepper and refrigerate in an airtight container until ready to use or up to 1 week."], "fat": 20.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Condiment/Spread", "Garlic", "Mustard", "No-Cook", "Quick & Easy", "Salad Dressing", "Vinegar", "Summer", "Chill", "Oregano"], "calories": 185.0, "desc": "This vinaigrette is great on any type of mixed green, pasta, or marinated vegetable salads.", "protein": 0.0, "rating": 3.75, "title": "Italian Vinaigrette ", "ingredients": ["1/4 cup red wine vinegar", "3 garlic cloves, minced", "1 teaspoon Dijon mustard", "2 tablespoons chopped fresh oregano or 2 teaspoons dried oregano", "3/4 cup extra-virgin olive oil", "Salt and freshly ground black pepper to taste", "N/A freshly ground black pepper"], "sodium": 155.0}, {"directions": ["Blend first 4 ingredients in processor until nuts are finely ground. Add butter; cut in using on/off turns until mixture resembles coarse meal. Add 2 tablespoons ice water and vanilla; process until moist clumps form, adding more ice water by teaspoonfuls if dough is dry. Gather dough into ball. Divide into 6 equal pieces. Flatten each into disk. Wrap each in plastic; chill 2 hours. (Can be made 2 days ahead. Keep chilled. Let dough soften slightly before continuing.)", "Preheat oven to 375°F. Press 1 dough disk evenly onto bottom and up sides of 4 1/2-inch-diameter tartlet pan with removable bottom. Pierce crust all over with fork. Repeat with remaining 5 dough disks. Freeze crusts until firm, about 20 minutes.", "Bake crusts until golden and baked through, about 25 minutes. Remove from oven. Immediately sprinkle bittersweet chocolate over bottom of hot crusts, dividing equally. Let stand until chocolate melts, about 5 minutes. Using back of spoon, spread chocolate over bottom of crusts. Chill until chocolate sets, about 10 minutes.", "Stir white chocolate in top of double boiler set over barely simmering water until just melted and smooth. Remove top of double boiler from over water. Cool white chocolate to room temperature. Beat cream and liqueur in medium bowl until soft peaks form. Fold cream mixture into melted white chocolate in 3 additions. Divide filling among tartlet crusts; smooth tops. Chill until filling is set, about 4 hours. (Can be made 1 day ahead. Cover loosely with foil; keep chilled.)", "Gently toss banana slices and orange juice in bowl. Transfer banana slices to paper towels; pat dry. Alternate banana slices and strawberry slices in circle atop tartlets, overlapping. (Can be prepared 2 hours ahead. Chill.)"], "fat": 59.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Milk/Cream", "Food Processor", "Mixer", "Berry", "Chocolate", "Dairy", "Fruit", "Nut", "Dessert", "Bake", "Strawberry", "Banana", "Summer", "Chill", "Party", "Double Boiler", "Bon Appétit", "Vegetarian", "Pescatarian", "Peanut Free", "Soy Free", "Kosher"], "calories": 830.0, "desc": "White Chocolate Tartlets with Strawberries and Bananas These irresistible sweets feature a hazelnut crust that is lined with dark chocolate and filled with white chocolate mousse.", "protein": 9.0, "rating": 4.375, "title": "White Chocolate Tartlets with Strawberries and Bananas ", "ingredients": ["1 1/4 cups all purpose flour", "1/2 cup hazelnuts, toasted, husked", "1/4 cup sugar", "1/4 teaspoon salt", "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch pieces", "2 tablespoons (or more) ice water", "1 teaspoon vanilla extract", "2 ounces bittersweet (not unsweetened) or semisweet chocolate, finely chopped", "6 ounces good-quality white chocolate (such as Lindt or Baker’s), finely chopped", "3/4 cup chilled whipping cream", "2 tablespoons Grand Marnier or other orange liqueur", "2 medium bananas, peeled, thinly sliced", "1/4 cup orange juice", "1 1-pint basket strawberries"], "sodium": 148.0}, {"directions": ["1 Heat the olive oil in a 3- or 4-quart saucepan over medium heat until shimmering. Add the onion, garlic, and 1/4 teaspoon of the salt. Cook, stirring frequently, until the onion softens and starts to brown at the edges, about 5 minutes. Add the tomato paste and Aleppo pepper and cook, stirring, until the mixture darkens, about 1 minute. Add the broth, the tomatoes with their juices, and the bulgur and bring to a boil, stirring and scraping the bottom of the pan.", "2 Decrease the heat to maintain a simmer, cover, and cook until the liquid is absorbed and the bulgur is tender but still slightly chewy, about 15 minutes. Add a tad more water if necessary. Remove the saucepan from the heat and season with the remaining 1/4 teaspoon salt. Taste for salt and adjust, and then stir in 1/4 cup of the basil. Cover and set aside for 3 minutes. Garnish with the remaining 2 tablespoons basil and serve."], "fat": 5.0, "date": "2013-09-20T04:00:00.000Z", "categories": ["Herb", "Tomato", "Vegetable", "Side", "Basil", "Bulgur", "Sugar Conscious", "Dairy Free", "Peanut Free", "Tree Nut Free", "Soy Free", "No Sugar Added", "Kosher"], "calories": 195.0, "desc": "When an abundance of fresh vine-ripened tomatoes piles high on my mother's kitchen counter in Thessa-loniki, she cooks up a simple pot of juicy bulgur with the fruit. This classic pairing is born out of necessity in the heat of summer in many parts of the Mediterranean. It nicely accompanies lamb chops, flank steak, chicken breast, or grilled shrimp.", "protein": 7.0, "rating": 0.0, "title": "Tomato-Infused Bulgur Pilaf with Fresh Basil ", "ingredients": ["1 tablespoon extra-virgin olive oil", "1 cup red onion, cut into 1/4-inch dice (about 1 small)", "1 clove garlic, peeled and crushed", "1/2 teaspoon fine sea salt", "2 tablespoons tomato paste", "1/2 to 1 teaspoon Aleppo pepper", "1 1/2 cups low-sodium chicken broth or vegetable broth", "1 cup coarsely chopped fresh tomatoes or diced canned tomatoes", "1 cup medium-coarse bulgur", "1/4 cup chopped fresh basil, plus 2 tablespoons for garnish"], "sodium": 469.0}, {"directions": ["Preheat oven to 450°F. and oil 2 large shallow baking pans.", "In a large bowl toss squash with oil until coated well and spread in one layer in pans. Roast squash in oven 10 minutes and season with salt. Stir squash and roast 10 to 15 minutes more, or until tender and beginning to turn golden.", "While squash is roasting, in a saucepan bring milk to a simmer with rosemary. Heat milk mixture over low heat 10 minutes and pour through a sieve into a large pitcher or measuring cup.", "In a large heavy saucepan cook garlic in butter over moderately low heat, stirring, until softened. Stir in flour and cook roux, stirring, 3 minutes. Remove pan from heat and whisk in milk mixture in a stream until smooth. Return pan to heat and simmer sauce, whisking occasionally, about 10 minutes, or until thick. Stir in squash and salt and pepper to taste. Sauce may be made 3 days ahead and chilled, its surface covered with plastic wrap.", "Reduce temperature to 375°F. and butter a baking dish, 13 by 9 by 2 inches.", "Pour 1 cup sauce into baking dish (sauce will not cover bottom completely) and cover with 3 lasagne sheets, making sure they do not touch each other. Spread half of remaining sauce over pasta and sprinkle with 1/2 cup Parmesan. Make 1 more layer in same manner, beginning and ending with pasta.", "In a bowl with an electric mixer beat cream with salt until it holds soft peaks and spread evenly over top pasta layer, making sure pasta is completely covered. Sprinkle remaining 1/3 cup Parmesan over cream. Cover dish tightly with foil, tenting slightly to prevent foil from touching top layer, and bake in middle of oven 30 minutes. Remove foil and bake lasagne 10 minutes more, or until top is bubbling and golden. Let lasagne stand 5 minutes.", "Garnish each serving with rosemary."], "fat": 42.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Cheese", "Dairy", "Garlic", "Herb", "Pasta", "Vegetable", "Bake", "Dinner", "Fall", "Winter", "Gourmet", "Vegetarian", "Pescatarian", "Peanut Free", "Tree Nut Free", "Soy Free", "No Sugar Added", "Kosher"], "calories": 684.0, "desc": null, "protein": 21.0, "rating": 4.375, "title": "Roasted Butternut Squash, Rosemary, and Garlic Lasagne ", "ingredients": ["3 pounds butternut squash, quartered, seeded, peeled, and cut into 1/2-inch dice (about 9 1/2 cups)", "3 tablespoons vegetable oil", "4 cups milk", "2 tablespoons dried rosemary, crumbled", "1 tablespoon minced garlic", "1/2 stick (1/4 cup) unsalted butter", "4 tablespoons all-purpose flour", "nine 7- by 3 1/2-inch sheets dry no-boil lasagne pasta", "1 1/3 cups freshly grated Parmesan (about 5 ounces)", "1 cup heavy cream", "1/2 teaspoon salt", "Garnish: fresh rosemary sprigs"], "sodium": 637.0}, {"directions": ["Mash first 3 ingredients in small bowl until almost smooth. Place bread on work surface and spread mixture on 1 side of each slice. Top each of 4 bread slices with 1/4 of beef, then onion and arugula. Season with pepper. Top with remaining bread, cheese side down.", "Melt butter in heavy large skillet over medium-high heat. Add sandwiches and cook until golden, about 2 minutes per side. Serve hot."], "fat": 37.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Sandwich", "Beef", "Cheese", "Leafy Green", "Onion", "Quick & Easy", "Blue Cheese", "Arugula", "Spring", "Bon Appétit"], "calories": 641.0, "desc": null, "protein": 39.0, "rating": 4.375, "title": "Grilled Roast Beef and Stilton Sandwich ", "ingredients": ["1 cup crumbled Stilton cheese", "2 tablespoons mayonnaise", "1 tablespoon prepared horseradish", "8 3x5-inch sourdough bread slices", "1 pound thinly sliced roast beef", "1/2 red onion, thinly sliced", "1 bunch arugula, stems trimmed", "2 tablespoons (1/4 stick) butter"], "sodium": 907.0}, {"directions": ["Purée all ingredients in blender. Strain into small bowl. (Can be prepared 3 days ahead. Cover; refrigerate.)", "Preheat oven to 350°F. Line four 3/4-cup soufflé dishes or custard cups with foil; spray lightly with nonstick spray. Finely grind nuts and sugar in processor. Add butter; blend until mixture holds together. Press 1/4 of nut mixture onto bottom of each prepared dish. Place dishes on baking sheet; bake crusts until slightly darker in color, 8 minutes. Set aside. Maintain oven temperature.", "Combine pear and nectar in small saucepan. Boil over medium heat until mixture resembles chunky sauce, stirring occasionally, about 18 minutes. Cool completely.", "Beat cream cheese and sugar in medium bowl until smooth. Beat in egg and vanilla. Beat in 2/3 cup chunky pear sauce (reserve any remaining sauce for another use). Divide filling among crusts.", "Bake cakes until center is set and slightly puffed, about 30 minutes. Cool in dishes on rack. Cover; chill overnight.", "Using foil as aid, lift cakes from dishes. Peel foil from sides. Slide spatula under crusts and transfer cakes to plates. Spoon pear-raspberry sauce around cakes. Garnish with mint, if desired."], "fat": 36.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Cake", "Berry", "Fruit", "Nut", "Dessert", "Bake", "Freeze/Chill", "Valentine's Day", "Mother's Day", "Cream Cheese", "Raspberry", "Pear", "Birthday", "Shower", "Hazelnut", "Party", "Bon Appétit", "Vegetarian", "Pescatarian", "Wheat/Gluten-Free", "Peanut Free", "Soy Free", "Kosher"], "calories": 538.0, "desc": "Make these individual desserts a day ahead.", "protein": 8.0, "rating": 3.75, "title": "Pear-Hazelnut Cheesecakes with Pear-Raspberry Sauce ", "ingredients": ["1 cup frozen unsweetened raspberries, thawed", "1/4 cup pear nectar", "3 tablespoons (packed) golden brown sugar", "Nonstick vegetable oil spray", "1/2 cup hazelnuts, toasted, husked", "1 1/2 teaspoons sugar", "1 1/2 teaspoons melted butter", "1 10-ounce pear, peeled, cored, chopped (about 1 1/2 cups)", "2/3 cup pear nectar", "1 8-ounce package cream cheese, room temperature", "3 tablespoons sugar", "1 large egg", "3/4 teaspoon vanilla extract", "Fresh mint (optional)"], "sodium": 231.0}, {"directions": ["1. Preheat the oven to 350°F. Spread the nuts on a baking sheet and roast for 10 to 15 minutes, or just until they begin to brown. Remove the baking sheet from the oven and allow the nuts to cool slightly.", "2. Place the nuts, salt, and honey in the bowl of the food processor fit with the chopping blade. Blend for 20 seconds. With the motor still running, drizzle 3 tablespoons of oil into the bowl through the chute in the lid, and process for 30 seconds. If the nut butter is still dry, continue to blend and add the additional tablespoon of oil. Process for up to another minute to reach your desired consistency. Taste and adjust for salt, if needed."], "fat": 24.0, "date": "2012-05-18T04:00:00.000Z", "categories": ["Condiment/Spread", "Food Processor", "Nut", "Roast", "Kid-Friendly", "Peanut", "Tree Nut", "Almond", "Cashew"], "calories": 264.0, "desc": null, "protein": 7.0, "rating": 3.75, "title": "Nut Butter ", "ingredients": ["1 pound (3 1/2 cups) shelled raw nuts", "1/2 teaspoon kosher salt, plus more to taste", "2 teaspoons honey", "3 to 4 tablespoons canola or peanut oil"], "sodium": 84.0}, {"directions": ["Combine the ingredients in a food processor. Process until the dough mixture leaves the sides of the bowl. Remove to a mixing bowl and knead by hand for a few minutes until smooth. (If the dough is too dry, add a few drops of water.) Divide into 4 equal parts and shape them into discs. Wrap in plastic wrap and let rest for 1 hour.", "Put the cheeses, salt, and pepper in a blender and pulse. Add the egg yolks and pulse until incorporated.", "Roll the discs of dough into thin sheets in a pasta machine. Arrange tablespoon-size dollops of the filling 1 1/2 inches apart on one of the sheets. Brush a little egg white around each dollop, then place another sheet directly on top. Gently press around the filling to remove any air pockets and seal the sheets. Using a ravioli cutter or a knife, cut out ravioli squares. Sprinkle with flour to prevent the dough from sticking.", "Cook the ravioli in plenty of boiling salted water until they float to the top, 3 to 4 minutes. Drain well and toss with the Fresh tomato sauce . Garnish with the remaining chopped basil and serve immediately."], "fat": 14.0, "date": "2006-03-01T04:00:00.000Z", "categories": ["Food Processor", "Egg", "Vegetarian", "Kid-Friendly", "Parmesan", "Ricotta", "Cookie"], "calories": 365.0, "desc": null, "protein": 19.0, "rating": 3.75, "title": "Cheese Ravioli with Fresh Tomato Sauce ", "ingredients": ["3 large eggs", "6 egg yolks", "3 cups flour", "A pinch of salt", "1 (16-ounce) container ricotta", "1 cup grated Parmesan", "Salt and black pepper to taste", "2 egg yolks (set the whites aside)", "Fresh tomato sauce"], "sodium": 599.0}, {"directions": ["Preheat oven to 350°F. Lightly butter three 8-inch-diameter cake pans with 2-inch-high sides; dust pans with flour. Combine cake flour, baking soda, baking powder and 1/2 teaspoon salt in medium bowl. Mix mashed bananas, buttermilk and 1 teaspoon vanilla in another medium bowl. Using electric mixer, beat 1/2 cup butter and sugar in large bowl until blended. Add eggs 1 at a time, beating to blend after each addition. Add dry ingredients alternately with banana mixture in 3 additions, beginning and ending with dry ingredients and beating just until blended after each addition. Divide batter equally among prepared pans.", "Bake cakes until tops are just beginning to color and tester inserted into center comes out with a few crumbs attached, about 20 minutes. Cool cakes in pans on racks 10 minutes. Using small knife, cut around cakes to loosen; turn cakes out onto racks and cool completely.", "Beat cream cheese and remaining 1 cup butter in large bowl until light and fluffy. Beat in remaining 1 tablespoon vanilla and pinch of salt. Gradually beat in powdered sugar. Cover and refrigerate frosting until firm enough to spread, about 15 minutes.", "Place 1 cake layer on platter. Spread 1/2 cup frosting over top. Place half of sliced bananas evenly over frosting, leaving 1/4-inch border at edge. Place second cake layer on work surface. Spread 1/4 cup frosting over top. Place cake layer, frosting side down, atop bananas. Spread 1/2 cup frosting over top. Place remaining half of sliced bananas evenly over frosting, leaving 1/4-inch border at edge. Place third cake layer on work surface. Spread 1/4 cup frosting over top. Place cake layer, frosting side down, atop bananas. Spread remaining frosting over sides and top of cake. (Can be made 1 day ahead. Cover and chill. Let stand 1 hour at room temperature before serving.)"], "fat": 56.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Cake", "Mixer", "Cheese", "Dairy", "Fruit", "Dessert", "Bake", "Cream Cheese", "Banana", "Birthday", "Family Reunion", "Shower", "Party", "Bon Appétit", "Vegetarian", "Pescatarian", "Peanut Free", "Tree Nut Free", "Soy Free", "Kosher"], "calories": 926.0, "desc": null, "protein": 9.0, "rating": 4.375, "title": "Banana Layer Cake with Cream Cheese Frosting ", "ingredients": ["2 1/4 cups cake flour", "3/4 teaspoon baking soda", "1/2 teaspoon baking powder", "1/2 teaspoon plus pinch of salt", "1 cup mashed ripe bananas (about 2 large)", "1/4 cup buttermilk", "1 teaspoon plus 1 tablespoon vanilla extract", "1 1/2 cups (3 sticks) unsalted butter, room temperature", "1 1/3 cups sugar", "2 large eggs", "2 8-ounce packages cream cheese, room temperature", "1 1/2 cups powdered sugar", "2 large bananas, peeled, sliced"], "sodium": 569.0}, {"directions": ["In a large bowl whisk together the lime juice, the salt, the chili powder, and the cayenne and add the jícama, tossing it to coat it well with the dressing. Arrange the oranges decoratively around the edge of the platter and mound the jícama with a slotted spoon in the center. Drizzle the dressing remaining in the bowl over the oranges and sprinkle the scallions over the salad."], "fat": 0.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Salad", "Appetizer", "Vegetarian", "Quick & Easy", "Low Cal", "Lime", "Orange", "Jícama", "Gourmet"], "calories": 26.0, "desc": null, "protein": 1.0, "rating": 3.125, "title": "South American-Style Jícama and Orange Salad ", "ingredients": ["1/3 cup fresh lime juice", "1 1/2 teaspoons salt, or to taste", "1 teaspoon chili powder, or to taste", "1/8 teaspoon cayenne, or to taste", "1 pound jícama (available at specialty produce markets and many supermarkets), peeled and cut into 1/3-inch-thick sticks", "4 navel oranges, rind and pith cut free with a serrated knife and the sections cut away from the membranes", "2 scallions, minced"], "sodium": 364.0}, {"directions": ["Preheat oven to 450°F.", "Halve squash lengthwise and discard seeds and strings. Cut each half lengthwise into 3 wedges and arrange wedges, skin sides down, in a shallow baking pan. In a small saucepan melt butter with brown sugar over moderate heat, stirring occasionally until sugar is dissolved. Stir in nutmeg and cloves and remove pan from heat. Spoon butter mixture over squash and cover baking pan with foil.", "Bake squash in middle of oven 30 minutes. Remove pan from oven and scatter chestnuts over squash. Re-cover pan with foil and roast squash and chestnuts 30 minutes, or until squash is tender. Squash and chestnuts may be made up to this point 6 hours ahead and kept, covered, at room temperature.", "Remove foil from pan and bake squash and chestnuts 20 minutes more. With a slotted spoon transfer squash and chestnuts to a serving dish. Stir sauce, scraping up brown-sugar drippings, and spoon over squash and chestnuts."], "fat": 7.0, "date": "2004-08-20T12:48:48.000Z", "categories": ["Vegetable", "Side", "Bake", "Thanksgiving", "Vegetarian", "High Fiber", "Butternut Squash", "Fall", "Chestnut", "Clove", "Nutmeg", "Gourmet", "Pescatarian", "Wheat/Gluten-Free", "Peanut Free", "Soy Free", "Kosher"], "calories": 230.0, "desc": null, "protein": 2.0, "rating": 3.75, "title": "Roasted Acorn Squash and Chestnuts ", "ingredients": ["4 small acorn squash", "1/2 stick (1/4 cup) unsalted butter", "1/2 cup packed brown sugar", "1/2 teaspoon freshly grated nutmeg", "1/2 teaspoon ground cloves", "2 cups vacuum-packed whole chestnuts* (not canned; about 3/4 pound)", "*available at specialty foods shops and some supermarkets"], "sodium": 9.0}, {"directions": ["Preheat oven to 325°F.", "Whisk together cream, milk, syrup, and pumpkin in a heavy saucepan and bring just to a simmer over moderate heat.", "Whisk together yolks, cinnamon, nutmeg, and salt in a bowl.", "Add hot pumpkin mixture to yolks in a slow stream, whisking constantly. Pour custard through a fine-mesh sieve into a large measuring cup, then divide among custard cups (you may have some custard left over, depending on size of cups). Bake custards in a hot water bath, pan covered tightly with foil, in middle of oven until a knife inserted in center of a custard comes out clean, 35 to 40 minutes. Transfer custards to a rack to cool completely. Chill, covered, until cold, at least 2 hours.", "Available at some cookware stores and Sur La Table (800-243-0852)."], "fat": 8.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Milk/Cream", "Dairy", "Egg", "Dessert", "Bake", "Thanksgiving", "Pumpkin", "Fall", "Maple Syrup", "Gourmet", "Anniversary"], "calories": 157.0, "desc": "Active time: 30 min Start to finish: 3 hr", "protein": 3.0, "rating": 4.375, "title": "Maple Pumpkin Pots de Crème ", "ingredients": ["1 cup heavy cream", "3/4 cup whole milk", "3/4 cup pure maple syrup", "1/2 cup canned solid-pack pumpkin", "7 large egg yolks", "1/2 teaspoon cinnamon", "1/8 teaspoon freshly grated nutmeg", "1/8 teaspoon salt", "Special equipment: 10 (2- to 3-oz) custard cups* or ramekins"], "sodium": 51.0}, {"directions": ["Mix milk, molasses, butter and salt in small saucepan. bring to simmer. Pour milk mixture into bowl of heavy-duty mixer fitted with paddle attachment. Cool to 155°F, about 30 minutes.", "Meanwhile place 1/4 cup warm water in measuring cup. Sprinkle yeast over and stir to blend. Let stand until yeast dissolves into milk mixture. Mix in 3/4 cup cornmeal. Mix in whole wheat flour. Mix in enough bread flour, 1/2 cup at a to form slightly sticky dough. Turn dough out onto floured surface. Knead until smooth and elastic, adding more bread flour if dough is too sticky, about 8 minutes. Form dough into ball.", "Butter large bowl. Place dough in bowl; turn to coat. Cover bowl with plastic wrap, then towel. Let dough rise in warm area until doubled, about 1 1/2 hours.", "Sprinkle 2 heavy large baking sheets generously with cornmeal. Punch down dough. Turn out onto floured surface and knead until smooth, about 3 minutes. Divide dough into 16 equal portions. Roll each portion between palms and work surface to 8-inch-long rope about 3/4 inch thick. Grasping 1 rope at both ends,tie into loose knot. Repeat with remaining ropes. Place on prepared baking sheets, spacing 2 inches apart. Cover with towels. Let rise in warm area until doubled, about 45 minutes.", "Position 1 rack in center and 1 rack in top third of oven and preheat to 375°F. Brush rolls with egg glaze. Sprinkle with seeds. Bake until rolls are golden and sound hollow when tapped, switching and rotating baking sheets halfway through baking, about 20 minutes. Transfer rolls to racks. (Can be made 2 weeks ahead. Cool. Wrap in foil; freeze. If desired, rewarm thawed wrapped rolls in 350°F oven 10 minutes.) Serve warm or at room temperature."], "fat": null, "date": "2004-08-20T04:00:00.000Z", "categories": ["Bread", "Milk/Cream", "Side", "Bake", "Vegetarian", "Cornmeal", "Molasses", "Seed", "Bon Appétit"], "calories": null, "desc": "Anadama bread recipes, which date back to pre-Revolutionary New England, all call for molasses and cornmeal for substantial- and delicious- results. This contemporary rendition is no exception.", "protein": null, "rating": 3.75, "title": "Anadama Rolls with Mixed Seeds ", "ingredients": ["1 1/2 cups milk (do not use low-fat or non-fat)", "1/3 cup mild-flavored (light) molasses", "2 tablespoons (1/4 stick) unsalted butter", "2 teaspoons salt", "1/4 cup warm water (105°F to 115°F)", "2 envelopes dry yeast", "3/4 cup yellow cornmeal", "1 1/2 cups whole wheat flour", "2 3/4 cups (about) bread flour", "Additional yellow cornmeal", "1 egg, beaten to blend (glaze)", "Assorted seeds (such as fennel, anise, celery and/or caraway)"], "sodium": null}, {"directions": ["Rinse the rice in a sieve under cold running water until the water runs clear; put to one side.", "Heat the olive oil in a large, heavy-bottomed pot and throw in the onions. Cook over medium heat until they soften and turn golden. Season the chicken thighs and add them to the pan. Brown on all sides, then pour in 2 1/2 cups water and bring to a simmer. Cover with a lid and cook until the chicken is tender, about 20 minutes.", "Meanwhile, peel the zest from the orange with a potato peeler, then cut it into matchstick strips. Blanch in a small pan of boiling water for a couple of minutes, then drain.", "Dissolve the sugar in 1/2 cup (scant) water in a small, heavy-bottomed pan over medium heat, then bring to a boil and let bubble to reduce and thicken for 5 to 10 minutes until syrupy. Add the orange zest, slivered almonds, and pistachios and boil for 5 minutes, skimming off any froth. Strain the syrup and return to the pan; set aside the orange zest and nuts. Add the saffron and rose water to the syrup and boil again for 3 minutes, then add the cardamom seeds.", "Preheat the oven to 300 degrees F. Strain the stock from the chicken thighs and add the syrup to it. Make this up to 3 cups with more water. Bring it to a boil in an ovenproof casserole and add the rice. Season and add two-thirds of the orange zest and nuts, keeping the rest to one side. Bring back to a boil, then cover and simmer until the rice is cooked. The liquid should have all been absorbed by now.", "Bury the chicken and onions in the rice and add the fava beans and peas, if you are including them. Put the lid on and cook in the oven for 20 minutes.", "Serve straight from the pan or, if you prefer, in a large, warmed serving dish. Sprinkle the last third of the orange zest and nuts over the top before bringing it to the table."], "fat": 73.0, "date": "2010-04-06T04:00:00.000Z", "categories": ["Chicken", "Citrus", "Fruit", "Nut", "Poultry", "Dinner", "Casserole/Gratin", "Orange", "Tree Nut", "Almond", "Pistachio", "Spice", "Saffron", "Potluck", "Advance Prep Required", "Dairy Free", "Wheat/Gluten-Free", "Peanut Free", "Soy Free", "Kosher"], "calories": 1172.0, "desc": "Here is a jewel of an Afghani dish. Unusual and exotic, it is one I cook regularly, sometimes with shoulder of lamb instead of chicken thighs. I serve it with slow-cooked spinach, finished with leeks and a minuscule amount of rhubarb. This may sound strange, but the rhubarb is sweetened by the leeks and it really does work.", "protein": 54.0, "rating": 4.375, "title": "Braised Chicken and Rice with Orange, Saffron, Almond, and Pistachio Syrup ", "ingredients": ["1 1/2 cups brown basmati rice", "1/4 cup olive oil", "2 medium onions, peeled and minced", "coarse salt and black pepper", "4 large chicken thighs, chopped in half, or 8 smaller ones", "about 4 cups water", "1 large organic orange", "1 tablespoon unrefined granulated sugar", "1/2 cup slivered blanched almonds", "1/2 cup shelled, chopped pistachio nuts", "large pinch of saffron threads", "2 to 3 teaspoons rose water", "7 or 8 cardamom pods, lightly crushed, seeds extracted", "a handful of blanched, skinned baby fava beans (optional)", "a handful of blanched peas (optional)"], "sodium": 220.0}, {"directions": ["In a microwave-safe bowl combine the potatoes, cut into 1-inch pieces, and the water and microwave the potatoes, covered with microwave-safe plastic wrap, at high power (100%) for 6 to 8 minutes, or until they are tender. Let the potatoes stand, covered, for 3 minutes, drain them, and let them cool completely. In a bowl whisk together the mayonnaise, the yogurt, the mustard, the vinegar, the horseradish, the dill and salt and pepper to taste, add the carrot, the onion, and the potatoes, and toss the salad until it is combined well."], "fat": 12.0, "date": "2004-08-20T04:00:00.000Z", "categories": ["Salad", "Microwave", "Potato", "Side", "Quick & Easy", "Horseradish", "Summer", "Dill", "Gourmet"], "calories": 298.0, "desc": "Can be prepared in 45 minutes or less.", "protein": 6.0, "rating": 4.375, "title": "Horseradish Dill Potato Salad ", "ingredients": ["1 pound small red potatoes", "1/4 cup water", "2 tablespoons mayonnaise", "2 tablespoons plain yogurt", "1 teaspoon Dijon-style mustard", "1 teaspoon balsamic vinegar", "1 teaspoon drained bottled horseradish, or to taste", "2 tablespoons minced fresh dill", "1 large carrot, shredded coarse (about 1 cup)", "1/4 cup finely chopped red onion"], "sodium": 199.0}, {"directions": ["Bring all ingredients to boil in large pot. Reduce heat; simmer uncovered until chicken is cooked through, about 30 minutes. Transfer chicken to bowl; cover to keep warm. Reserve chicken broth in pot; spoon off fat from surface.", "Heat heavy large skillet over medium-low heat. Add pepitas; stir frequently until seeds puff and begin to pop, about 15 minutes (do not brown). Transfer to dish; cool. Set aside 2 tablespoons pepitas for garnish. Working in batches, finely grind remaining pepitas with peppercorns in spice mill or coffee grinder.", "Puree tomatillos, next 5 ingredients, and 1/2 cup reserved chicken broth in blender until almost smooth. Heat 2 tablespoons oil in heavy medium skillet over medium-high heat. Add tomatillo mixture and simmer until sauce is thick and reduced to 1 cup, stirring frequently, about 5 minutes.", "Heat remaining 4 tablespoons oil in heavy large pot over medium heat. Add ground pepita mixture. Stir constantly until mixture resembles very coarse paste and begins to color in spots, about 9 minutes. Add tomatillo mixture; stir 1 minute. Add 2 cups reserved chicken broth and bring to boil. Reduce heat to medium-low and simmer until sauce is thick, stirring constantly, about 3 minutes longer. Season sauce to taste with salt. Spoon some sauce onto platter. Top with chicken. Spoon remaining sauce over. Garnish with reserved 2 tablespoons pepitas."], "fat": 57.0, "date": "2004-08-20T12:48:48.000Z", "categories": ["Chicken", "Low/No Sugar", "Cinco de Mayo", "Hot Pepper", "Spring", "Healthy", "Tomatillo", "Cilantro", "Seed", "Simmer", "Bon Appétit"], "calories": 682.0, "desc": "Pipián Verde con Pollo", "protein": 36.0, "rating": 4.375, "title": "Chicken in Green Pumpkin-Seed Sauce ", "ingredients": ["5 cups water", "6 chicken thighs with skin and bones", "1/4 large white onion", "3 garlic cloves, halved", "3 large fresh cilantro sprigs", "1 teaspoon fine sea salt", "1 2/3 cups shelled pepitas (pumpkin seeds)", "6 whole black peppercorns", "12 ounces tomatillos, husked, rinsed, coarsely chopped", "1/4 cup chopped white onion", "1/4 cup chopped fresh cilantro", "3 medium serrano chiles, chopped with seeds", "2 garlic cloves, chopped", "1 teaspoon fine sea salt", "6 tablespoons corn oil"], "sodium": 909.0}, {"directions": ["Preheat oven to 350°. Spread pistachios on a rimmed baking sheet and toast until just beginning to brown, about 4 minutes. Transfer to a plate, let cool, then coarsely chop. Spread almonds on the same baking sheet and toast until golden brown, 5-8 minutes; let cool. Set nuts aside.", "Place rice in a fine-mesh sieve and rinse under cold water until water runs clear. Cook rice in a large pot of boiling salted water, stirring occasionally, until grains have lengthened but are still firm, 6-7 minutes; drain and rinse under cold water. Spread rice on another rimmed baking sheet; let cool.", "Meanwhile, using a vegetable peeler, remove zest from orange and thinly slice lengthwise (reserve flesh for another use). Bring sugar and 1 cup water to a boil in a medium saucepan, stirring to dissolve sugar. Add orange zest and carrots, reduce heat, and simmer, stirring occasionally, until carrots are tender, 15-20 minutes; drain and set aside (discard syrup).", "Combine barberries and raisins in a small bowl and cover with hot water; let soak 10 minutes. Drain and set aside. Place saffron in another small bowl and add 1/4 cup hot water; set aside.", "Heat butter and 1 tablespoon oil in a large skillet over medium heat. Add onion, season with salt, and cook, stirring often, until soft and beginning to brown, 8-10 minutes. Add cardamom, cumin, turmeric, and 1 tablespoon saffron mixture. Cook, stirring constantly, until fragrant, about 1 minute.", "Reduce heat to low, add barberries and raisins, and cook, stirring often, about 3 minutes. Stir in reserved nuts and orange zest and carrot mixture; season with salt. Set fruit and nut mixture aside.", "Heat remaining 3 tablespoons oil in a large wide heavy pot over medium heat. Add half of rice, spreading evenly; top with fruit and nut mixture, then remaining rice, spreading evenly. Using the end of a wooden spoon, poke 5-6 holes in rice all the way through to bottom of pot (to help release steam and help rice cook evenly).", "Drizzle remaining saffron mixture over rice. Place a clean kitchen towel over pot, cover with a tight-fitting lid, and secure loose edges of towel on top of lid, using a rubber band or masking tape.", "Cook until pot begins to steam, 5-8 minutes. Reduce heat to very low and cook, without stirring, until rice is tender and bottom layer of rice is browned and crisp, 30-40 minutes.", "Scoop rice into a wide serving bowl, breaking bottom crust into pieces.", "DO AHEAD: Fruit and nut mixture can be made 2 days ahead. Cover fruit and nut mixture and remaining saffron mixture separately and chill."], "fat": 18.0, "date": "2013-05-09T04:00:00.000Z", "categories": ["Onion", "Side", "Cranberry", "Orange", "Almond", "Pistachio", "Saffron", "Carrot", "Bon Appétit", "Vegetarian", "Pescatarian", "Wheat/Gluten-Free", "Peanut Free", "Soy Free", "Kosher"], "calories": 517.0, "desc": "Yes, making this rice is a time commitment and a labor of love. But the ingredients aren't difficult to find, and the finished dish is stunning.", "protein": 7.0, "rating": 5.0, "title": "Jeweled Rice ", "ingredients": ["1/4 cup unsalted, shelled raw natural pistachios", "1/4 cup slivered almonds", "2 cups basmati rice", "Kosher salt", "1 orange", "1/2 cup sugar", "2 medium carrots, peeled, cut into matchstick-size pieces", "1/4 cup dried barberries or 1/2 cup dried cranberries", "1/4 cup raisins", "1/4 teaspoon saffron threads", "2 tablespoons unsalted butter", "4 tablespoons olive oil, divided", "1 medium onion, finely chopped", "1/4 teaspoon ground cardamom", "1/4 teaspoon ground cumin", "1/4 teaspoon ground turmeric", "ingredient info: Dried barberries, sold as zereshk, are available at Middle Eastern markets and kalustyans.com."], "sodium": 20.0}, {"directions": ["Mix all ingredients in a small bowl.", "Rub brisket all over with spice rub. Cover and chill for at least 2 hours or overnight. Let stand at room temperature for 1 hour before continuing.", "Preheat oven to 325°F. Heat 1 tablespoon oil in a large wide pot over high heat. Add brisket, fat side down. Cook undisturbed until well browned, 5-6 minutes. Turn brisket over and cook until browned, about 3 minutes. Using tongs, transfer to a plate. Reduce heat to medium and add remaining 1 tablespoon oil. Add onion and garlic. Cook, stirring occasionally, until onion is slightly golden, about 5 minutes. Add broth and all remaining ingredients. Bring liquid to a simmer. Return brisket to pot. Cover and transfer to oven.", "Braise until brisket is very tender to the touch but still holds its shape, about 4 1/2 hours. Using a large spatula, transfer brisket, fat side up, to a large plate. Strain braising liquid into a large bowl. Return liquid to pot, bring to a simmer, and cook until reduced to 2 cups, about 15 minutes. Score fat side of brisket by cutting a crosshatch pattern of 1/4\"-deep slits spaced 1/2\" apart. Return brisket, fat side up, to pot with reduced braising liquid. DO AHEAD: Brisket can be made 2 days ahead. Return brisket to pot, cover, and chill. Bring to a simmer and rewarm brisket before proceeding.", "Transfer 1/4 cup braising liquid to a blender. Add jam and bourbon and purée until smooth. Season with salt and pepper.", "Preheat broiler. Spread 3-4 tablespoons glaze on top of brisket with the back of a spoon. Broil brisket in pot until browned and glazed, watching carefully to prevent burning, 4-5 minutes.", "Transfer brisket to a cutting board. Slice against the grain and transfer to a large platter. Ladle braising liquid over. Drizzle remaining glaze on top."], "fat": 54.0, "date": "2012-01-18T04:00:00.000Z", "categories": ["Beer", "Bourbon", "Beef", "Braise", "Dinner", "Meat", "Brisket", "Winter", "Jam or Jelly", "Bon Appétit", "Dairy Free", "Peanut Free", "Tree Nut Free", "Kosher"], "calories": 856.0, "desc": "No one will fault you for seasoning brisket with salt and pepper, braising it in beer, and calling it a day. But follow chef Lee's method—which calls for a bath of stout, bourbon, and soy sauce; a glaze made with peach jam; and a side of easy homemade pickles if you'd like—and you're on the path to savory-and-sweet nirvana.", "protein": 45.0, "rating": 4.375, "title": "Braised Brisket with Bourbon-Peach Glaze ", "ingredients": ["1 tablespoon plus 1 teaspoon kosher salt", "1 teaspoon freshly ground black pepper", "1/4 teaspoon smoked paprika", "1/8 teaspoon ground cinnamon", "1 4-pound trimmed flat-cut brisket with about 1/3\" top layer of fat", "2 tablespoons grapeseed oil, divided", "3/4 cup chopped onion", "3 garlic cloves, smashed", "4 cups beef broth", "1 12-ounce bottle stout", "3/4 cup bourbon", "1/4 cup (packed) light brown sugar", "1/4 cup soy sauce", "6 large sprigs thyme", "3 celery stalks, chopped", "2 plum tomatoes, cored, chopped", "1 large carrot, chopped", "1 tablespoon balsamic vinegar", "1/2 cup peach jam or preserves", "2 teaspoons bourbon", "Kosher salt and freshly ground black pepper", "Ingredient info: Smoked paprika can be found at most supermarkets, at specialty foods stores, and at latienda.com."], "sodium": 1797.0}]